RT-Thread/rt-thread/bsp/renesas/ra4m1-ek/ra/fsp/src/r_flash_lp/r_flash_lp.c
/*
* Copyright (c) 2020 - 2025 Renesas Electronics Corporation and/or its affiliates
*
* SPDX-License-Identifier: BSD-3-Clause
*/

/***********************************************************************************************************************
 * Includes
 **********************************************************************************************************************/
#include "bsp_api.h"
#include <string.h>

#include "r_flash_lp.h"

/* Configuration for this package. */
#include "r_flash_lp_cfg.h"

/***********************************************************************************************************************
 * Macro definitions
 **********************************************************************************************************************/

/** "OPEN" in ASCII, used to avoid multiple open. */
#define FLASH_HP_OPEN                                 (0x4f50454eULL)

#define FLASH_HP_MINIMUM_SUPPORTED_FCLK_FREQ          (4000000U) /*/ Minimum FCLK for Flash Operations in Hz*/

/* The number of CPU cycles per each timeout loop. */
#ifndef FLASH_LP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP
 #if defined(__GNUC__)
  #define FLASH_LP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP    (6U)
 #elif defined(__ICCARM__)
  #define FLASH_LP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP    (6U)
 #endif
#endif

#define FLASH_LP_HZ_IN_MHZ                            (1000000U)

#if defined(__ICCARM__)
 #define BSP_ATTRIBUTE_STACKLESS                      __stackless
#elif defined(__GNUC__)

 #define BSP_ATTRIBUTE_STACKLESS                      __attribute__((naked))
#endif

/* Roughly 4 cycles per loop */
#define FLASH_LP_DELAY_LOOP_CYCLES                    4U

/*  flash mode definition (FENTRYR Register setting)*/
#define FLASH_LP_FENTRYR_DATAFLASH_PE_MODE            (0xAA80U)
#define FLASH_LP_FENTRYR_CODEFLASH_PE_MODE            (0xAA01U)
#define FLASH_LP_FENTRYR_READ_MODE                    (0xAA00U)

/*  flash mode definition (FPMCR Register setting)*/
#define FLASH_LP_DATAFLASH_PE_MODE                    (0x10U)
#define FLASH_LP_READ_MODE                            (0x08U)
#define FLASH_LP_LVPE_MODE                            (0x40U)
#define FLASH_LP_DISCHARGE_1                          (0x12U)
#define FLASH_LP_DISCHARGE_2                          (0x92U)
#define FLASH_LP_CODEFLASH_PE_MODE                    (0x82U)

/*  operation definition (FCR Register setting)*/
#define FLASH_LP_FCR_WRITE                            (0x81U)
#define FLASH_LP_FCR_ERASE                            (0x84U)
#define FLASH_LP_FCR_BLANKCHECK                       (0x83U)
#define FLASH_LP_FCR_CLEAR                            (0x00U)

/*  operation definition (FEXCR Register setting)*/
#define FLASH_LP_FEXCR_STARTUP                        (0x81U)
#define FLASH_LP_FEXCR_AW                             (0x82U)
#define FLASH_LP_FEXCR_OCDID1                         (0x83U)
#define FLASH_LP_FEXCR_OCDID2                         (0x84U)
#define FLASH_LP_FEXCR_OCDID3                         (0x85U)
#define FLASH_LP_FEXCR_OCDID4                         (0x86U)
#define FLASH_LP_FEXCR_CLEAR                          (0x00U)
#define FLASH_LP_FEXCR_MF4_CONTROL                    (0x81U)
#define FLASH_LP_FEXCR_MF4_AW_STARTUP                 (0x82U)

/* Wait Process definition */
#define FLASH_LP_WAIT_TDIS                            (3U)
#if (BSP_FEATURE_FLASH_LP_VERSION == 4)
 #define FLASH_LP_WAIT_TMS_HIGH                       (16U) /* "Flash memory mode transition wait time 2" in the "Code Flash Memory Characteristics" subsection of the hardware manual*/
#else
 #define FLASH_LP_WAIT_TMS_HIGH                       (6U)  /* tMS wait time on flash version 3*/
#endif
#define FLASH_LP_WAIT_TMS_MID                         (4U)
#define FLASH_LP_WAIT_TDSTOP                          (6U)

/* Flash information */
/* Used for DataFlash */
#define FLASH_LP_DATAFLASH_READ_BASE_ADDR             (0x40100000U)
#define FLASH_LP_DATAFLASH_WRITE_BASE_ADDR            (0xFE000000U)
#define FLASH_LP_DATAFLASH_ADDR_OFFSET                (FLASH_LP_DATAFLASH_WRITE_BASE_ADDR - \
                                                       FLASH_LP_DATAFLASH_READ_BASE_ADDR)

#define FLASH_LP_FENTRYR_DF_PE_MODE                   (0x0080U)
#define FLASH_LP_FENTRYR_CF_PE_MODE                   (0x0001U)
#define FLASH_LP_FENTRYR_PE_MODE_BITS                 (FLASH_LP_FENTRYR_DF_PE_MODE | FLASH_LP_FENTRYR_CF_PE_MODE)

#if BSP_FEATURE_FLASH_LP_VERSION == 4
 #define FLASH_LP_PRV_FENTRYR                         R_FACI_LP->FENTRYR_MF4
#else
 #define FLASH_LP_PRV_FENTRYR                         R_FACI_LP->FENTRYR
#endif

#define FLASH_LP_FSCMR_FSPR_AND_UNUSED_BITS           (0xFEFFU)

#define FLASH_LP_MF4_FAWEMR_STARTUP_AREA_MASK         (0x8000U)

#define FLASH_LP_FCR_PROCESSING_MASK                  (0x80U)
#define FLASH_LP_FEXCR_PROCESSING_MASK                (0x80U)

#define FLASH_LP_MAX_WRITE_CF_TIME_US                 (1411)
#define FLASH_LP_MAX_WRITE_DF_TIME_US                 (886)
#define FLASH_LP_MAX_BLANK_CHECK_TIME_US              (88)
#define FLASH_LP_MAX_ERASE_CF_BLOCK_TIME_US           (355000)
#define FLASH_LP_MAX_ERASE_DF_BLOCK_TIME_US           (504000)
#define FLASH_LP_MAX_WRITE_EXTRA_AREA_TIME_US         (2289000)

#define FLASH_LP_FSTATR2_ILLEGAL_ERROR_BITS           (0x10)
#define FLASH_LP_FSTATR2_ERASE_ERROR_BITS             (0x11)
#define FLASH_LP_FSTATR2_WRITE_ERROR_BITS             0x12

#define FLASH_LP_FISR_INCREASE_PCKA_EVERY_2MHZ        (32)

#define FLASH_LP_3BIT_MASK                            (0x7U)
#define FLASH_LP_6BIT_MASK                            (0x3FU)
#define FLASH_LP_5BIT_MASK                            (0x1FU)

#define FLASH_LP_DF_START_ADDRESS                     (0x40100000)

#define FLASH_LP_FPR_UNLOCK                           (0xA5U)

#define FLASH_LP_BANK_PROGRAMMING_EXIT                (0x6D00)
#define FLASH_LP_BANK_PROGRAMMING_ENTER               (0x6D01)

#define FLASH_LP_BANK_SWAP_UPDATE_ENABLE              (0xC301)
#define FLASH_LP_BANK_SWAP_UPDATE_DISABLE             (0xC300)
#define FLASH_LP_EXTRA_AREA_FCTLF_ADDRESS             (0x01010008)

/** The maximum timeout for commands is 100usec when FCLK is 16 MHz i.e. 1600 FCLK cycles.
 * Assuming worst case of ICLK at 240 MHz and FCLK at 4 MHz, and optimization set to max such that
 * each count decrement loop takes only 5 cycles, then ((240/4)*1600)/5 = 19200 */
#define FLASH_LP_FRDY_CMD_TIMEOUT                     (19200)

#define FLASH_LP_REGISTER_WAIT_TIMEOUT(val, reg, timeout, err) \
    while (val != reg)                                         \
    {                                                          \
        if (0 == timeout)                                      \
        {                                                      \
            return err;                                        \
        }                                                      \
        timeout--;                                             \
    }

/** Flash P/E related functions are not required to be in RAM when using Bank Programming. */
#if (FLASH_LP_CFG_CODE_FLASH_BANK_PROGRAMMING_ENABLE == 0)
 #define FLASH_PE_PLACE_IN_RAM_SECTION    PLACE_IN_RAM_SECTION
#else
 #define FLASH_PE_PLACE_IN_RAM_SECTION
#endif

