RT-Thread/rt-thread/bsp/renesas/ra4m1-ek/ra/fsp/src/r_flash_lp/r_flash_lp.c
/******************************************************************************
 * Typedef definitions
 ******************************************************************************/

/**
 * @struct r_dataflash_data_t
 * DATAFLASH information values
 */
typedef struct r_dataflash_data_t
{
    uint32_t start_addr;               /* start address (Erase) or Ram Source for Write, Dest for read */
    uint32_t end_addr;                 /* end address (Erase), or Flash Start address which will be read/written */
    uint32_t write_cnt;                /* bytes remaining to do */
} r_dataflash_data_t;

typedef struct r_dataflash_erase_t
{
    uint32_t start_addr;               /* start address (Erase) or Ram Source for Write, Dest for read */
    uint32_t end_addr;                 /* end address (Erase), or Flash Start address which will be read/written */
    uint32_t write_cnt;                /* bytes remaining to do */
} r_dataflash_erase_t;

/**   FLASH operation command values */
typedef enum e_flash_command
{
    FLASH_COMMAND_ACCESSWINDOW,        /**< Flash access window command */
    FLASH_COMMAND_STARTUPAREA          /**< Flash change startup area command */
} r_flash_command_t;

/******************************************************************************
 * Exported global variables
 ******************************************************************************/

/***********************************************************************************************************************
 * Private global variables
 **********************************************************************************************************************/

/***********************************************************************************************************************
 * Private function prototypes
 **********************************************************************************************************************/
static void r_flash_lp_init(flash_lp_instance_ctrl_t * p_ctrl);

static void r_flash_lp_df_enter_pe_mode(flash_lp_instance_ctrl_t * const p_ctrl);

#if (FLASH_LP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1)

static void r_flash_lp_df_write_operation(flash_lp_instance_ctrl_t * const p_ctrl);

static fsp_err_t r_flash_lp_df_blankcheck(flash_lp_instance_ctrl_t * const p_ctrl,
                                          uint32_t                         start_address,
                                          uint32_t                         num_bytes,
                                          flash_result_t                 * result);

static fsp_err_t r_flash_lp_df_erase(flash_lp_instance_ctrl_t * const p_ctrl,
                                     uint32_t                         block_address,
                                     uint32_t                         num_blocks);

#endif

static fsp_err_t r_flash_lp_set_fisr(flash_lp_instance_ctrl_t * const p_ctrl);

static fsp_err_t r_flash_lp_setup(flash_lp_instance_ctrl_t * p_ctrl);

static void r_flash_lp_process_command(const uint32_t start_addr, uint32_t num_bytes,
                                       uint32_t command) FLASH_PE_PLACE_IN_RAM_SECTION;

static fsp_err_t r_flash_lp_command_finish(uint32_t timeout) FLASH_PE_PLACE_IN_RAM_SECTION;

static void r_flash_lp_reset(flash_lp_instance_ctrl_t * const p_ctrl) PLACE_IN_RAM_SECTION;

static fsp_err_t r_flash_lp_wait_for_ready(flash_lp_instance_ctrl_t * const p_ctrl,
                                           uint32_t                         timeout,
                                           uint32_t                         error_bits,
                                           fsp_err_t                        return_code) FLASH_PE_PLACE_IN_RAM_SECTION;

static fsp_err_t r_flash_lp_write(flash_lp_instance_ctrl_t * const p_ctrl) FLASH_PE_PLACE_IN_RAM_SECTION;

static fsp_err_t r_flash_lp_pe_mode_exit(flash_lp_instance_ctrl_t * const p_ctrl) PLACE_IN_RAM_SECTION;

static void r_flash_lp_delay_us(uint32_t us, uint32_t mhz) PLACE_IN_RAM_SECTION __attribute__((noinline));

static void r_flash_lp_write_fpmcr(uint8_t value) PLACE_IN_RAM_SECTION;

#if (FLASH_LP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)
static void r_flash_lp_memcpy(uint8_t * const dest, uint8_t * const src, uint32_t len) FLASH_PE_PLACE_IN_RAM_SECTION;

static fsp_err_t r_flash_lp_extra_command_finish(uint32_t timeout) PLACE_IN_RAM_SECTION;

static fsp_err_t r_flash_lp_cf_blankcheck(flash_lp_instance_ctrl_t * const p_ctrl,
                                          uint32_t                         start_address,
                                          uint32_t                         num_bytes,
                                          flash_result_t                 * result) FLASH_PE_PLACE_IN_RAM_SECTION;

static fsp_err_t r_flash_lp_cf_erase(flash_lp_instance_ctrl_t * const p_ctrl,
                                     uint32_t                         block_address,
                                     uint32_t                         num_blocks,
                                     uint32_t                         block_size) FLASH_PE_PLACE_IN_RAM_SECTION;

static void r_flash_lp_cf_write_operation(flash_lp_instance_ctrl_t * const p_ctrl) FLASH_PE_PLACE_IN_RAM_SECTION;

static void r_flash_lp_cf_enter_pe_mode(flash_lp_instance_ctrl_t * const p_ctrl, bool bank_programming)
PLACE_IN_RAM_SECTION;

static fsp_err_t r_flash_lp_extra_check(flash_lp_instance_ctrl_t * const p_ctrl) PLACE_IN_RAM_SECTION;

static fsp_err_t r_flash_lp_set_startup_area_boot(flash_lp_instance_ctrl_t * const p_ctrl,
                                                  flash_startup_area_swap_t        swap_type,
                                                  bool                             temporary)
PLACE_IN_RAM_SECTION;

static fsp_err_t r_flash_lp_access_window_set(flash_lp_instance_ctrl_t * const p_ctrl,
                                              uint32_t const                   start_addr,
                                              uint32_t const                   end_addr) PLACE_IN_RAM_SECTION;

static fsp_err_t r_flash_lp_set_id_code(flash_lp_instance_ctrl_t * const p_ctrl,
                                        uint8_t const * const            p_id_code,
                                        flash_id_code_mode_t             mode) PLACE_IN_RAM_SECTION;

static void r_flash_lp_extra_operation(const uint32_t    start_addr_startup_value,
                                       const uint32_t    end_addr,
                                       r_flash_command_t command) PLACE_IN_RAM_SECTION;

