RT-Thread/rt-thread/bsp/renesas/ra4m1-ek/ra/fsp/src/r_flash_lp/r_flash_lp.c
 #if (BSP_FEATURE_FLASH_LP_SUPPORTS_DUAL_BANK == 1)
static fsp_err_t r_flash_lp_bank_swap(flash_lp_instance_ctrl_t * const p_ctrl) PLACE_IN_RAM_SECTION;

 #endif

#endif

#if (FLASH_LP_CFG_PARAM_CHECKING_ENABLE == 1)

static fsp_err_t r_flash_lp_common_parameter_checking(flash_lp_instance_ctrl_t * const p_ctrl);

static fsp_err_t r_flash_lp_write_read_bc_parameter_checking(flash_lp_instance_ctrl_t * const p_ctrl,
                                                             uint32_t                         flash_address,
                                                             uint32_t const                   num_bytes,
                                                             bool                             check_write);

#endif

/** FRDY ISR is only used for DataFlash operations and Code flash operations when Bank Programming is supported.
 *  Other Code flash operations are blocking. Therefore ISR does not need to be located in RAM.
 */
void fcu_frdyi_isr(void);

/***********************************************************************************************************************
 * Exported global variables
 **********************************************************************************************************************/
const flash_api_t g_flash_on_flash_lp =
{
    .open                         = R_FLASH_LP_Open,
    .close                        = R_FLASH_LP_Close,
    .write                        = R_FLASH_LP_Write,
    .erase                        = R_FLASH_LP_Erase,
    .blankCheck                   = R_FLASH_LP_BlankCheck,
    .statusGet                    = R_FLASH_LP_StatusGet,
    .infoGet                      = R_FLASH_LP_InfoGet,
    .accessWindowSet              = R_FLASH_LP_AccessWindowSet,
    .accessWindowClear            = R_FLASH_LP_AccessWindowClear,
    .idCodeSet                    = R_FLASH_LP_IdCodeSet,
    .reset                        = R_FLASH_LP_Reset,
    .startupAreaSelect            = R_FLASH_LP_StartUpAreaSelect,
    .bankSwap                     = R_FLASH_LP_BankSwap,
    .updateFlashClockFreq         = R_FLASH_LP_UpdateFlashClockFreq,
    .callbackSet                  = R_FLASH_LP_CallbackSet,
    .antiRollbackCounterIncrement = R_FLASH_LP_AntiRollbackCounterIncrement,
    .antiRollbackCounterRefresh   = R_FLASH_LP_AntiRollbackCounterRefresh,
    .antiRollbackCounterRead      = R_FLASH_LP_AntiRollbackCounterRead,
    .userLockableAreaWrite        = R_FLASH_LP_UserLockableAreaWrite,
};

const flash_block_info_t g_code_flash_macro_info =
{
    .block_section_st_addr  = 0,
    .block_section_end_addr = BSP_ROM_SIZE_BYTES - 1,
    .block_size             = BSP_FEATURE_FLASH_LP_CF_BLOCK_SIZE,
    .block_size_write       = BSP_FEATURE_FLASH_LP_CF_WRITE_SIZE
};

static flash_regions_t g_flash_code_region =
{
    .num_regions   = 1,
    .p_block_array = &g_code_flash_macro_info
};

const flash_block_info_t g_data_flash_macro_info =
{
    .block_section_st_addr  = FLASH_LP_DF_START_ADDRESS,
    .block_section_end_addr = FLASH_LP_DF_START_ADDRESS + BSP_DATA_FLASH_SIZE_BYTES - 1,
    .block_size             = BSP_FEATURE_FLASH_LP_DF_BLOCK_SIZE,
    .block_size_write       = BSP_FEATURE_FLASH_LP_DF_WRITE_SIZE
};

static flash_regions_t g_flash_data_region =
{
    .num_regions   = 1,
    .p_block_array = &g_data_flash_macro_info
};

/***********************************************************************************************************************
 * Functions
 **********************************************************************************************************************/

/*******************************************************************************************************************//**
 * @addtogroup FLASH_LP
 * @{
 **********************************************************************************************************************/

/*******************************************************************************************************************//**
 * Initialize the Low Power flash peripheral. Implements @ref flash_api_t::open.
 *
 * The Open function initializes the Flash.
 *
 * This function must be called once prior to calling any other FLASH API functions. If a user supplied callback
 * function is supplied, then the Flash Ready interrupt will be configured to call the users callback routine with an
 * Event type describing the source of the interrupt for Data Flash operations.
 *
 * Example:
 * @snippet r_flash_lp_example.c R_FLASH_LP_Open
 *
 * @note       Providing a callback function in the supplied p_cfg->callback field automatically configures the Flash
 *             for Data Flash to operate in non-blocking background operation (BGO) mode.
 *
 * @retval     FSP_SUCCESS               Initialization was successful and timer has started.
 * @retval     FSP_ERR_ASSERTION         NULL provided for p_ctrl, p_cfg or p_callback if BGO is enabled.
 * @retval     FSP_ERR_IRQ_BSP_DISABLED  Caller is requesting BGO but the Flash interrupts are not enabled.
 * @retval     FSP_ERR_FCLK              FCLK must be a minimum of 4 MHz for Flash operations.
 * @retval     FSP_ERR_ALREADY_OPEN      Flash Open() has already been called.
 * @retval     FSP_ERR_TIMEOUT           Failed to exit P/E mode after configuring flash.
 * @retval     FSP_ERR_INVALID_STATE     The system is not running from the required clock or the required clock is not running and stable.
 **********************************************************************************************************************/
fsp_err_t R_FLASH_LP_Open (flash_ctrl_t * const p_api_ctrl, flash_cfg_t const * const p_cfg)
{
    flash_lp_instance_ctrl_t * p_ctrl = (flash_lp_instance_ctrl_t *) p_api_ctrl;

    fsp_err_t err = FSP_SUCCESS;

    /* If null pointers return error. */
#if (FLASH_LP_CFG_PARAM_CHECKING_ENABLE)
    FSP_ASSERT(NULL != p_cfg);
    FSP_ASSERT(NULL != p_ctrl);

    /* If open return error. */
    FSP_ERROR_RETURN((FLASH_HP_OPEN != p_ctrl->opened), FSP_ERR_ALREADY_OPEN);
 #if BSP_FEATURE_FLASH_LP_VERSION == 4

    /* MF4 devices must have HOCO running and stable in order to program and erase flash. */
  #if BSP_FEATURE_CGC_REGISTER_SET_B

    /* HOCO is selected when ICLK source is FMAIN, FMAIN source is FOCO, and FOCO source is HOCO. */
    FSP_ERROR_RETURN((0U == R_SYSTEM->ICLKSCR_b.CKST) &&
                     (0U == R_SYSTEM->FMAINSCR_b.CKST) &&
                     (0U == R_SYSTEM->FOCOSCR_b.CKST),
                     FSP_ERR_INVALID_STATE);
  #else

