RT-Thread/rt-thread/bsp/renesas/ra4m1-ek/ra/fsp/src/r_flash_lp/r_flash_lp.c
    /* If HOCO is not operating, return error */
    FSP_ERROR_RETURN(0U == R_SYSTEM->HOCOCR_b.HCSTP, FSP_ERR_INVALID_STATE);

    /* If HOCO is not stable, return error */
    FSP_ERROR_RETURN(1U == R_SYSTEM->OSCSF_b.HOCOSF, FSP_ERR_INVALID_STATE);
  #endif
 #endif

 #if FLASH_LP_CFG_DATA_FLASH_BGO_SUPPORT_ENABLE == 1 || FLASH_LP_CFG_CODE_FLASH_BANK_PROGRAMMING_ENABLE == 1

    /* Background operations are enabled but the flash interrupt is disabled. */
    if (p_cfg->data_flash_bgo || (1U == FLASH_LP_CFG_CODE_FLASH_BANK_PROGRAMMING_ENABLE))
    {
        FSP_ERROR_RETURN(p_cfg->irq >= (IRQn_Type) 0, FSP_ERR_IRQ_BSP_DISABLED);
        FSP_ASSERT(NULL != p_cfg->p_callback);
    }
 #endif
#endif
    p_ctrl->p_cfg = p_cfg;

#if FLASH_LP_CFG_DATA_FLASH_BGO_SUPPORT_ENABLE == 1 || FLASH_LP_CFG_CODE_FLASH_BANK_PROGRAMMING_ENABLE == 1
    if (p_cfg->data_flash_bgo || (1U == FLASH_LP_CFG_CODE_FLASH_BANK_PROGRAMMING_ENABLE))
    {
        R_BSP_IrqCfg(p_cfg->irq, p_cfg->ipl, p_ctrl);
    }
#endif

    p_ctrl->current_operation = FLASH_OPERATION_NON_BGO;

    /* Check FCLK, calculate timeout values. */
    err = r_flash_lp_setup(p_ctrl);
    FSP_ERROR_RETURN((err == FSP_SUCCESS), err);

    /* Set the FlashIF peripheral clock frequency. */
    err = r_flash_lp_set_fisr(p_ctrl);
    FSP_ERROR_RETURN((err == FSP_SUCCESS), err);

    p_ctrl->opened = FLASH_HP_OPEN;

    return err;
}

/*******************************************************************************************************************//**
 * Write to the specified Code or Data Flash memory area. Implements @ref flash_api_t::write.
 *
 * Example:
 * @snippet r_flash_lp_example.c R_FLASH_LP_Write
 *
 * @retval     FSP_SUCCESS               Operation successful. If BGO is enabled this means the operation was started
 *                                       successfully.
 * @retval     FSP_ERR_IN_USE            The Flash peripheral is busy with a prior on-going transaction.
 * @retval     FSP_ERR_NOT_OPEN          The Flash API is not Open.
 * @retval     FSP_ERR_WRITE_FAILED      Status is indicating a Programming error for the requested operation. This may
 *                                       be returned if the requested Flash area is not blank.
 * @retval     FSP_ERR_TIMEOUT           Timed out waiting for FCU operation to complete.
 * @retval     FSP_ERR_INVALID_SIZE      Number of bytes provided was not a multiple of the programming size or exceeded
 *                                       the maximum range.
 * @retval     FSP_ERR_INVALID_ADDRESS   Invalid address was input or address not on programming boundary.
 * @retval     FSP_ERR_ASSERTION         NULL provided for p_ctrl.
 **********************************************************************************************************************/
fsp_err_t R_FLASH_LP_Write (flash_ctrl_t * const p_api_ctrl,
                            uint32_t const       src_address,
                            uint32_t             flash_address,
                            uint32_t const       num_bytes)
{
    flash_lp_instance_ctrl_t * p_ctrl = (flash_lp_instance_ctrl_t *) p_api_ctrl;
    fsp_err_t err = FSP_SUCCESS;

#if (FLASH_LP_CFG_PARAM_CHECKING_ENABLE == 1)

    /* Check parameters. If failure return error */
    err = r_flash_lp_write_read_bc_parameter_checking(p_ctrl, flash_address, num_bytes, true);
    FSP_ERROR_RETURN((err == FSP_SUCCESS), err);
#endif

    p_ctrl->current_operation = FLASH_OPERATION_NON_BGO;

#if (FLASH_LP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1) && (FLASH_LP_CFG_PARAM_CHECKING_ENABLE == 1)
    if (flash_address < BSP_ROM_SIZE_BYTES)
    {
 #if FLASH_LP_CFG_CODE_FLASH_BANK_PROGRAMMING_ENABLE == 1

        /* Verify the source address is not in BANK1 of code flash. It will not be available in P/E mode. */
        FSP_ERROR_RETURN((src_address > BSP_ROM_SIZE_BYTES) || ((src_address + num_bytes) < (BSP_ROM_SIZE_BYTES / 2)),
                         FSP_ERR_INVALID_ADDRESS);

        /* The target flash area must be in Bank1 when using Bank Programming. */
        FSP_ERROR_RETURN(flash_address >= (BSP_FEATURE_FLASH_CODE_FLASH_START + (BSP_ROM_SIZE_BYTES / 2)),
                         FSP_ERR_INVALID_ADDRESS);
 #else

        /* Verify the source address is not in code flash. It will not be available in P/E mode. */
        FSP_ASSERT(src_address > BSP_ROM_SIZE_BYTES);
 #endif
    }
#endif

    p_ctrl->dest_end_address     = flash_address;
    p_ctrl->source_start_address = src_address;
    p_ctrl->operations_remaining = num_bytes;

    err = r_flash_lp_write(p_ctrl);

    /* Return status. */
    return err;
}

/*******************************************************************************************************************//**
 * Erase the specified Code or Data Flash blocks. Implements @ref flash_api_t::erase.
 *
 * Example:
 * @snippet r_flash_lp_example.c R_FLASH_LP_Erase
 *
 * @retval     FSP_SUCCESS               Successful open.
 * @retval     FSP_ERR_INVALID_BLOCKS    Invalid number of blocks specified
 * @retval     FSP_ERR_INVALID_ADDRESS   Invalid address specified
 * @retval     FSP_ERR_IN_USE            Other flash operation in progress, or API not initialized
 * @retval     FSP_ERR_ASSERTION         NULL provided for p_ctrl
 * @retval     FSP_ERR_NOT_OPEN          The Flash API is not Open.
 * @retval     FSP_ERR_TIMEOUT           Timed out waiting for FCU to be ready.
 * @retval     FSP_ERR_ERASE_FAILED      Status is indicating a Erase error.
 **********************************************************************************************************************/
fsp_err_t R_FLASH_LP_Erase (flash_ctrl_t * const p_api_ctrl, uint32_t const address, uint32_t const num_blocks)
{
    flash_lp_instance_ctrl_t * p_ctrl = (flash_lp_instance_ctrl_t *) p_api_ctrl;

    fsp_err_t err = FSP_SUCCESS;

#if (FLASH_LP_CFG_PARAM_CHECKING_ENABLE == 1)

    /* Verify the control block is not null and is opened. */
    err = r_flash_lp_common_parameter_checking(p_ctrl);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

    /* If invalid number of blocks return error. */
    FSP_ERROR_RETURN(num_blocks != 0U, FSP_ERR_INVALID_BLOCKS);
#endif

    p_ctrl->current_operation = FLASH_OPERATION_NON_BGO;

