RT-Thread/rt-thread/bsp/renesas/ra4m1-ek/ra/fsp/src/r_flash_lp/r_flash_lp.c
#if (FLASH_LP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)

    /* Configure the current parameters based on if the operation is for code flash or data flash. */
    if (address < BSP_ROM_SIZE_BYTES)
    {
        uint32_t start_address = address & ~(BSP_FEATURE_FLASH_LP_CF_BLOCK_SIZE - 1);

 #if (FLASH_LP_CFG_PARAM_CHECKING_ENABLE == 1)
        uint32_t num_bytes = num_blocks * BSP_FEATURE_FLASH_LP_CF_BLOCK_SIZE;

  #if FLASH_LP_CFG_CODE_FLASH_BANK_PROGRAMMING_ENABLE == 1

        /* Verify start address is in BANK1 */
        FSP_ERROR_RETURN(start_address >= (BSP_FEATURE_FLASH_CODE_FLASH_START + (BSP_ROM_SIZE_BYTES / 2)),
                         FSP_ERR_INVALID_ADDRESS);
  #endif

        /* Verify erase will not write past end of code flash */
        FSP_ERROR_RETURN((start_address + num_bytes) <= (BSP_FEATURE_FLASH_CODE_FLASH_START + BSP_ROM_SIZE_BYTES),
                         FSP_ERR_INVALID_BLOCKS);
 #endif

        err = r_flash_lp_cf_erase(p_ctrl, start_address, num_blocks, BSP_FEATURE_FLASH_LP_CF_BLOCK_SIZE);
    }
    else
#endif
    {
#if (FLASH_LP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1)
        uint32_t start_address = address & ~(BSP_FEATURE_FLASH_LP_DF_BLOCK_SIZE - 1);

 #if (FLASH_LP_CFG_PARAM_CHECKING_ENABLE == 1)
        uint32_t num_bytes = num_blocks * BSP_FEATURE_FLASH_LP_DF_BLOCK_SIZE;

        FSP_ERROR_RETURN((start_address >= (FLASH_LP_DF_START_ADDRESS)) &&
                         (start_address < (FLASH_LP_DF_START_ADDRESS + BSP_DATA_FLASH_SIZE_BYTES)),
                         FSP_ERR_INVALID_ADDRESS);

        FSP_ERROR_RETURN(start_address + num_bytes <= (FLASH_LP_DF_START_ADDRESS + BSP_DATA_FLASH_SIZE_BYTES),
                         FSP_ERR_INVALID_BLOCKS);
 #endif

        /* Initiate the flash erase. */
        err = r_flash_lp_df_erase(p_ctrl, start_address, num_blocks);
#else

        return FSP_ERR_INVALID_ADDRESS;
#endif
    }

    return err;
}

/*******************************************************************************************************************//**
 * Perform a blank check on the specified address area. Implements @ref flash_api_t::blankCheck.
 *
 * Example:
 * @snippet r_flash_lp_example.c R_FLASH_LP_BlankCheck
 *
 * @retval     FSP_SUCCESS                 Blankcheck operation completed with result in p_blank_check_result, or
 *                                         blankcheck started and in-progess (BGO mode).
 * @retval     FSP_ERR_INVALID_ADDRESS     Invalid data flash address was input
 * @retval     FSP_ERR_INVALID_SIZE        'num_bytes' was either too large or not aligned for the CF/DF boundary size.
 * @retval     FSP_ERR_IN_USE              Flash is busy with an on-going operation.
 * @retval     FSP_ERR_ASSERTION           NULL provided for p_ctrl
 * @retval     FSP_ERR_NOT_OPEN            Flash API has not yet been opened.
 * @retval     FSP_ERR_TIMEOUT             Timed out waiting for the FCU to become ready.
 * @retval     FSP_ERR_BLANK_CHECK_FAILED  An error occurred during blank checking.
 **********************************************************************************************************************/
fsp_err_t R_FLASH_LP_BlankCheck (flash_ctrl_t * const p_api_ctrl,
                                 uint32_t const       address,
                                 uint32_t             num_bytes,
                                 flash_result_t     * p_blank_check_result)
{
    flash_lp_instance_ctrl_t * p_ctrl = (flash_lp_instance_ctrl_t *) p_api_ctrl;
    fsp_err_t err = FSP_SUCCESS;

#if (FLASH_LP_CFG_PARAM_CHECKING_ENABLE == 1)

    /* Check parameters. If failure return error */
    err = r_flash_lp_write_read_bc_parameter_checking(p_ctrl, address, num_bytes, false);
    FSP_ERROR_RETURN((err == FSP_SUCCESS), err);
#endif

    p_ctrl->current_operation = FLASH_OPERATION_NON_BGO;

    /* Initiate the Blank Check operation */
    /* Configure the current operation and wait count based on the number of bytes and if it's a data flash or code flash operation. */
    /* Is this a request to Blank check Code Flash? */
#if (FLASH_LP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)
    if (address < BSP_ROM_SIZE_BYTES)
    {
        /* This is a request to Blank check Code Flash */
        err = r_flash_lp_cf_blankcheck(p_ctrl, address, num_bytes, p_blank_check_result);
    }
    else
#endif
    {
#if (FLASH_LP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1)

        /* This is a request to Blank check Data Flash */
        err = r_flash_lp_df_blankcheck(p_ctrl, address, num_bytes, p_blank_check_result);
#endif
    }

    /* If failure reset the flash. */
    if (FSP_SUCCESS != err)
    {
        /* This will clear error flags and exit the P/E mode*/
        r_flash_lp_reset(p_ctrl);
    }

    return err;
}

/*******************************************************************************************************************//**
 * Query the FLASH for its status. Implements @ref flash_api_t::statusGet.
 *
 * Example:
 * @snippet r_flash_lp_example.c R_FLASH_LP_StatusGet
 *
 * @retval     FSP_SUCCESS        Flash is ready and available to accept commands.
 * @retval     FSP_ERR_ASSERTION  NULL provided for p_ctrl
 * @retval     FSP_ERR_NOT_OPEN   Flash API has not yet been opened.
 **********************************************************************************************************************/
fsp_err_t R_FLASH_LP_StatusGet (flash_ctrl_t * const p_api_ctrl, flash_status_t * const p_status)
{
    fsp_err_t err = FSP_SUCCESS;

#if (FLASH_LP_CFG_PARAM_CHECKING_ENABLE == 1)
    flash_lp_instance_ctrl_t * p_ctrl = (flash_lp_instance_ctrl_t *) p_api_ctrl;

    /* If null control block return error. */
    FSP_ASSERT(NULL != p_ctrl);

    /* If null status pointer return error. */
    FSP_ASSERT(NULL != p_status);

    /* If control block is not open return error. */
    FSP_ERROR_RETURN((FLASH_HP_OPEN == p_ctrl->opened), FSP_ERR_NOT_OPEN);
#else
    FSP_PARAMETER_NOT_USED(p_api_ctrl);
#endif

    /* Return flash status */
    if ((FLASH_LP_PRV_FENTRYR & FLASH_LP_FENTRYR_PE_MODE_BITS) == 0x0000U)
    {
        *p_status = FLASH_STATUS_IDLE;
    }
    else
    {
        *p_status = FLASH_STATUS_BUSY;
    }

