RT-Thread/rt-thread/bsp/renesas/ra4m1-ek/ra/fsp/src/r_flash_lp/r_flash_lp.c
#if (FLASH_LP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)
 #if (FLASH_LP_CFG_PARAM_CHECKING_ENABLE)

    /* Verify the control block is not null and is opened. */
    err = r_flash_lp_common_parameter_checking(p_ctrl);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

    /* Verify the id bytes are not in code flash. They will not be available in P/E mode. */
    FSP_ASSERT(((uint32_t) p_id_code) > BSP_ROM_SIZE_BYTES);
 #endif

    /* Set the id code. */
    err = r_flash_lp_set_id_code(p_ctrl, p_id_code, mode);
#else

    /* Eliminate warning if code flash programming is disabled. */
    FSP_PARAMETER_NOT_USED(p_ctrl);
    FSP_PARAMETER_NOT_USED(p_id_code);
    FSP_PARAMETER_NOT_USED(mode);

    err = FSP_ERR_UNSUPPORTED;         /* For consistency with _LP API we return error if Code Flash not enabled*/
#endif

    /* Return status. */
    return err;
}

/*******************************************************************************************************************//**
 * Reset the FLASH peripheral. Implements @ref flash_api_t::reset.
 *
 * No attempt is made to check if the flash is busy before executing the reset since the assumption is that a reset
 * will terminate any existing operation.
 * @retval     FSP_SUCCESS        Flash circuit successfully reset.
 * @retval     FSP_ERR_ASSERTION  NULL provided for p_ctrl
 * @retval     FSP_ERR_NOT_OPEN   Flash API has not yet been opened.
 **********************************************************************************************************************/
fsp_err_t R_FLASH_LP_Reset (flash_ctrl_t * const p_api_ctrl)
{
    flash_lp_instance_ctrl_t * p_ctrl = (flash_lp_instance_ctrl_t *) p_api_ctrl;

    fsp_err_t err = FSP_SUCCESS;

#if (FLASH_LP_CFG_PARAM_CHECKING_ENABLE)

    /* If null control block return error. */
    FSP_ASSERT(NULL != p_ctrl);

    /* If control block is not open return error. */
    FSP_ERROR_RETURN((FLASH_HP_OPEN == p_ctrl->opened), FSP_ERR_NOT_OPEN);
#endif

    /* Reset the flash. */
    r_flash_lp_reset(p_ctrl);

    return err;
}

/*******************************************************************************************************************//**
 * Select which block is used as the startup area block. Implements @ref flash_api_t::startupAreaSelect.
 *
 * Selects which block - Default (Block 0) or Alternate (Block 1) is used as the startup area block. The provided
 * parameters determine which block will become the active startup block and whether that action will be immediate (but
 * temporary), or permanent subsequent to the next reset. Doing a temporary switch might appear to have limited
 * usefulness. If there is an access window in place such that Block 0 is write protected, then one could do a temporary
 * switch, update the block and switch them back without having to touch the access window.
 *
 * @retval     FSP_SUCCESS               Start-up area successfully toggled.
 * @retval     FSP_ERR_IN_USE            Flash is busy with an on-going operation.
 * @retval     FSP_ERR_ASSERTION         NULL provided for p_ctrl
 * @retval     FSP_ERR_NOT_OPEN          Flash API has not yet been opened.
 * @retval     FSP_ERR_WRITE_FAILED      Status is indicating a Programming error for the requested operation.
 * @retval     FSP_ERR_TIMEOUT           Timed out waiting for the FCU to become ready.
 * @retval     FSP_ERR_UNSUPPORTED       Code Flash Programming is not enabled. Cannot set FLASH_STARTUP_AREA_BTFLG
 *                                       when the temporary flag is false.
 **********************************************************************************************************************/
fsp_err_t R_FLASH_LP_StartUpAreaSelect (flash_ctrl_t * const      p_api_ctrl,
                                        flash_startup_area_swap_t swap_type,
                                        bool                      is_temporary)
{
    flash_lp_instance_ctrl_t * p_ctrl = (flash_lp_instance_ctrl_t *) p_api_ctrl;

    fsp_err_t err = FSP_SUCCESS;

#if (FLASH_LP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)
 #if (FLASH_LP_CFG_PARAM_CHECKING_ENABLE)

    /* Verify the control block is not null and is opened. */
    err = r_flash_lp_common_parameter_checking(p_ctrl);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);
 #endif

    /* If the swap type is BTFLG and the operation is temporary there's nothing to do. */
    FSP_ASSERT(!((swap_type == FLASH_STARTUP_AREA_BTFLG) && (is_temporary == false)));

    err = r_flash_lp_set_startup_area_boot(p_ctrl, swap_type, is_temporary);
#else

    /* Eliminate warning if code flash programming is disabled. */
    FSP_PARAMETER_NOT_USED(p_ctrl);
    FSP_PARAMETER_NOT_USED(swap_type);
    FSP_PARAMETER_NOT_USED(is_temporary);

    err = FSP_ERR_UNSUPPORTED;         /* For consistency with _LP API we return error if Code Flash not enabled*/
#endif

    return err;
}

/*******************************************************************************************************************//**
 * Swap the Code Flash bank to update new program. Implement @ref flash_api_t::bankSwap.
 *
 * Swap the flash bank located at address 0x00000000 and address 0x00040000. After a bank swap is done the MCU will
 * need to be reset for the changes to take place unless instant swap is enabled.
 *
 * To use this API, Code Flash Programming in the FSP Configuration Tool under Stack Properties must be enabled.
 *
 * @note This function only available on MCUs which support bank swap feature.
 *
 * @note When active bank is bank 1, startup program protection function is invalid.
 *
 * @param[in]   p_api_ctrl              The api control instance.
 *
 * @retval      FSP_SUCCESS             Banks were swapped.
 * @retval      FSP_ERR_UNSUPPORTED     Module does not support Bank Swap.
 * @retval      FSP_ERR_ASSERTION       NULL provided for p_ctrl.
 * @retval      FSP_ERR_NOT_OPEN        The control block is not open.
 * @retval      FSP_ERR_IN_USE          Extra area is being used by other command.
 **********************************************************************************************************************/
fsp_err_t R_FLASH_LP_BankSwap (flash_ctrl_t * const p_api_ctrl)
{
    fsp_err_t err = FSP_SUCCESS;

#if (FLASH_LP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1) && (BSP_FEATURE_FLASH_LP_SUPPORTS_DUAL_BANK == 1)
    flash_lp_instance_ctrl_t * p_ctrl = (flash_lp_instance_ctrl_t *) p_api_ctrl;

 #if (FLASH_LP_CFG_PARAM_CHECKING_ENABLE)

    /* Verify the control block is not null and is opened. */
    err = r_flash_lp_common_parameter_checking(p_ctrl);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);
 #endif

    err = r_flash_lp_bank_swap(p_ctrl);
#else

    /* Eliminate unused warning. */
    FSP_PARAMETER_NOT_USED(p_api_ctrl);

