RT-Thread/rt-thread/bsp/renesas/ra4m1-ek/ra/fsp/src/r_flash_lp/r_flash_lp.c
    err = FSP_ERR_UNSUPPORTED;
#endif

    return err;
}

/*******************************************************************************************************************//**
 * Indicate to the already open Flash API that the FCLK has changed. Implements flash_api_t::updateFlashClockFreq.
 *
 * This could be the case if the application has changed the system clock, and therefore the FCLK. Failure to call this
 * function subsequent to changing the FCLK could result in damage to the flash macro.
 *
 * @retval     FSP_SUCCESS        Start-up area successfully toggled.
 * @retval     FSP_ERR_IN_USE     Flash is busy with an on-going operation.
 * @retval     FSP_ERR_FCLK       Invalid flash clock source frequency.
 * @retval     FSP_ERR_ASSERTION  NULL provided for p_ctrl
 * @retval     FSP_ERR_NOT_OPEN   Flash API has not yet been opened.
 * @retval     FSP_ERR_TIMEOUT    Timed out waiting for the FCU to become ready.
 **********************************************************************************************************************/
fsp_err_t R_FLASH_LP_UpdateFlashClockFreq (flash_ctrl_t * const p_api_ctrl)
{
    flash_lp_instance_ctrl_t * p_ctrl = (flash_lp_instance_ctrl_t *) p_api_ctrl;

    fsp_err_t err = FSP_SUCCESS;

#if (FLASH_LP_CFG_PARAM_CHECKING_ENABLE)

    /* Verify the control block is not null and is opened. */
    err = r_flash_lp_common_parameter_checking(p_ctrl);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);
#endif

    /* Check FCLK, calculate timeout values. */
    err = r_flash_lp_setup(p_ctrl);
    FSP_ERROR_RETURN((err == FSP_SUCCESS), err);

    /* Set the FlashIF peripheral clock frequency. */
    err = r_flash_lp_set_fisr(p_ctrl);

    return err;
}

/*******************************************************************************************************************//**
 * Returns the information about the flash regions. Implements @ref flash_api_t::infoGet.
 *
 * @retval     FSP_SUCCESS        Successful retrieved the request information.
 * @retval     FSP_ERR_ASSERTION  NULL provided for p_ctrl or p_info.
 * @retval     FSP_ERR_NOT_OPEN   The flash is not open.
 **********************************************************************************************************************/
fsp_err_t R_FLASH_LP_InfoGet (flash_ctrl_t * const p_api_ctrl, flash_info_t * const p_info)
{
#if FLASH_LP_CFG_PARAM_CHECKING_ENABLE
    flash_lp_instance_ctrl_t * p_ctrl = (flash_lp_instance_ctrl_t *) p_api_ctrl;

    /* If null control block return error. */
    FSP_ASSERT(NULL != p_ctrl);

    /* If control block is not open return error. */
    FSP_ERROR_RETURN((FLASH_HP_OPEN == p_ctrl->opened), FSP_ERR_NOT_OPEN);

    FSP_ASSERT(NULL != p_info);
#else
    FSP_PARAMETER_NOT_USED(p_api_ctrl);
#endif

    /* Copy the region data to the info structure. */
    p_info->code_flash = g_flash_code_region;
    p_info->data_flash = g_flash_data_region;

    return FSP_SUCCESS;
}

/*******************************************************************************************************************//**
 * Release any resources that were allocated by the Flash API. Implements @ref flash_api_t::close.
 *
 * @retval     FSP_SUCCESS        Successful close.
 * @retval     FSP_ERR_ASSERTION  NULL provided for p_ctrl or p_cfg.
 * @retval     FSP_ERR_NOT_OPEN   Flash API has not yet been opened.
 * @retval     FSP_ERR_IN_USE     The flash is currently in P/E mode.
 **********************************************************************************************************************/
fsp_err_t R_FLASH_LP_Close (flash_ctrl_t * const p_api_ctrl)
{
    flash_lp_instance_ctrl_t * p_ctrl = (flash_lp_instance_ctrl_t *) p_api_ctrl;

#if FLASH_LP_CFG_PARAM_CHECKING_ENABLE

    /* Verify the control block is not null and is opened. */
    fsp_err_t err = r_flash_lp_common_parameter_checking(p_ctrl);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);
#endif

    /* Mark the control block as closed. */
    p_ctrl->opened = 0;

#if FLASH_LP_CFG_DATA_FLASH_BGO_SUPPORT_ENABLE == 1

    /* Disable the flash interrupt. */
    if (FSP_INVALID_VECTOR != p_ctrl->p_cfg->irq)
    {
        /* Disable interrupt in ICU*/
        R_BSP_IrqDisable(p_ctrl->p_cfg->irq);
    }
#endif

    return FSP_SUCCESS;
}

/*******************************************************************************************************************//**
 * Stub function
 * Implements @ref flash_api_t::callbackSet.
 *
 * @retval  FSP_ERR_UNSUPPORTED          Function has not been implemented.
 **********************************************************************************************************************/
fsp_err_t R_FLASH_LP_CallbackSet (flash_ctrl_t * const          p_api_ctrl,
                                  void (                      * p_callback)(flash_callback_args_t *),
                                  void * const                  p_context,
                                  flash_callback_args_t * const p_callback_memory)
{
    FSP_PARAMETER_NOT_USED(p_api_ctrl);
    FSP_PARAMETER_NOT_USED(p_callback);
    FSP_PARAMETER_NOT_USED(p_callback_memory);
    FSP_PARAMETER_NOT_USED(p_context);

    return FSP_ERR_UNSUPPORTED;
}

/*******************************************************************************************************************//**
 * Stub function
 * Implements @ref flash_api_t::antiRollbackCounterIncrement.
 *
 * @retval  FSP_ERR_UNSUPPORTED          Function has not been implemented.
 **********************************************************************************************************************/
fsp_err_t R_FLASH_LP_AntiRollbackCounterIncrement (flash_ctrl_t * const p_api_ctrl, flash_arc_t counter)
{
    FSP_PARAMETER_NOT_USED(p_api_ctrl);
    FSP_PARAMETER_NOT_USED(counter);

    return FSP_ERR_UNSUPPORTED;
}

/*******************************************************************************************************************//**
 * Stub function
 * Implements @ref flash_api_t::antiRollbackCounterRefresh.
 *
 * @retval  FSP_ERR_UNSUPPORTED          Function has not been implemented.
 **********************************************************************************************************************/
fsp_err_t R_FLASH_LP_AntiRollbackCounterRefresh (flash_ctrl_t * const p_api_ctrl, flash_arc_t counter)
{
    FSP_PARAMETER_NOT_USED(p_api_ctrl);
    FSP_PARAMETER_NOT_USED(counter);

    return FSP_ERR_UNSUPPORTED;
}

/*******************************************************************************************************************//**
 * Stub function
 * Implements @ref flash_api_t::antiRollbackCounterRead.
 *
 * @retval  FSP_ERR_UNSUPPORTED          Function has not been implemented.
 **********************************************************************************************************************/
fsp_err_t R_FLASH_LP_AntiRollbackCounterRead (flash_ctrl_t * const p_api_ctrl,
                                              flash_arc_t          counter,
                                              uint32_t * const     p_count)
{
    FSP_PARAMETER_NOT_USED(p_api_ctrl);
    FSP_PARAMETER_NOT_USED(counter);
    FSP_PARAMETER_NOT_USED(p_count);

    return FSP_ERR_UNSUPPORTED;
}

/*******************************************************************************************************************//**
 * Stub function
 * Implements @ref flash_api_t::userLockableAreaWrite.
 *
 * @retval  FSP_ERR_UNSUPPORTED          Function has not been implemented.
 **********************************************************************************************************************/
fsp_err_t R_FLASH_LP_UserLockableAreaWrite (flash_ctrl_t * const p_api_ctrl,
                                            uint32_t const       src_address,
                                            uint32_t             flash_address,
                                            uint32_t const       num_bytes)
{
    FSP_PARAMETER_NOT_USED(p_api_ctrl);
    FSP_PARAMETER_NOT_USED(src_address);
    FSP_PARAMETER_NOT_USED(flash_address);
    FSP_PARAMETER_NOT_USED(num_bytes);

    return FSP_ERR_UNSUPPORTED;
}

/*******************************************************************************************************************//**
 * @} (end addtogroup FLASH_LP)
 **********************************************************************************************************************/

/*******************************************************************************************************************//**
 * This function verifies that FCLK falls within the allowable range and calculates the timeout values based on the
 * current FCLK frequency.
 * @param      p_ctrl        The p control
 * @retval     FSP_SUCCESS   Success
 * @retval     FSP_ERR_FCLK  FCLK must be 1 MHz, 2 MHz, 3 MHz or a minimum of 4 MHz.
 **********************************************************************************************************************/
static fsp_err_t r_flash_lp_setup (flash_lp_instance_ctrl_t * p_ctrl)
{
    fsp_err_t err = FSP_SUCCESS;

    /* Get the frequency of the clock driving the flash. */
    p_ctrl->flash_clock_frequency = R_FSP_SystemClockHzGet(BSP_FEATURE_FLASH_LP_FLASH_CLOCK_SRC);

