RT-Thread/rt-thread/bsp/renesas/ra4m1-ek/ra/fsp/src/r_flash_lp/r_flash_lp.c
    /* FCLK must be 1 MHz, 2 MHz, 3 MHz or a minimum of 4 MHz for Flash operations. If not return error. */
    if (p_ctrl->flash_clock_frequency < FLASH_HP_MINIMUM_SUPPORTED_FCLK_FREQ)
    {
        FSP_ERROR_RETURN((p_ctrl->flash_clock_frequency == (1 * FLASH_LP_HZ_IN_MHZ)) ||
                         (p_ctrl->flash_clock_frequency == (2 * FLASH_LP_HZ_IN_MHZ)) ||
                         (p_ctrl->flash_clock_frequency == (3 * FLASH_LP_HZ_IN_MHZ)),
                         FSP_ERR_FCLK);
    }

    /* Get the frequency of the system clock. */
    p_ctrl->system_clock_frequency = R_FSP_SystemClockHzGet(FSP_PRIV_CLOCK_ICLK);

    /* Initialize the flash timeout calculations and transfer global parameters to code and data flash layers. */
    r_flash_lp_init(p_ctrl);

    /* Enable the DataFlash if not already enabled */
    if (1U != R_FACI_LP->DFLCTL)
    {
        R_FACI_LP->DFLCTL = 1U;

        /* Wait for (tDSTOP) before reading from data flash. */
        r_flash_lp_delay_us(FLASH_LP_WAIT_TDSTOP, p_ctrl->system_clock_frequency);
    }

    return err;
}

#if (FLASH_LP_CFG_PARAM_CHECKING_ENABLE == 1)

/*******************************************************************************************************************//**
 * This function performs the parameter checking required by Write, Read and BlankCheck functions.
 *
 * @param      p_ctrl                   Pointer to the control block
 * @param[in]  flash_address            The flash address
 * @param[in]  num_bytes                The number bytes
 * @param[in]  check_write              Check parameters for writing.
 *
 * @retval     FSP_SUCCESS              Parameter checking completed without error.
 * @retval     FSP_ERR_NOT_OPEN         The Flash API is not Open.
 * @retval     FSP_ERR_ASSERTION        Null pointer
 * @retval     FSP_ERR_INVALID_SIZE     Number of bytes provided was not a multiple of the programming size or exceeded
 *                                      the maximum range.
 * @retval     FSP_ERR_INVALID_ADDRESS  Invalid address was input or address not on programming boundary.
 * @retval     FSP_ERR_IN_USE           The flash is currently in P/E mode.
 **********************************************************************************************************************/
static fsp_err_t r_flash_lp_write_read_bc_parameter_checking (flash_lp_instance_ctrl_t * const p_ctrl,
                                                              uint32_t                         flash_address,
                                                              uint32_t const                   num_bytes,
                                                              bool                             check_write)
{
    /* Verify the control block is not null and is opened. */
    fsp_err_t err = r_flash_lp_common_parameter_checking(p_ctrl);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

    /* If invalid address or number of bytes return error. */
 #if (FLASH_LP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 0)
    FSP_PARAMETER_NOT_USED(check_write);
 #else
    if (flash_address < BSP_ROM_SIZE_BYTES)
    {
        /* If the start address is in code flash verify the end address is in code flash. */
        FSP_ERROR_RETURN(flash_address + num_bytes <= BSP_ROM_SIZE_BYTES, FSP_ERR_INVALID_SIZE);

        if (check_write)
        {
            FSP_ERROR_RETURN(!(flash_address & (BSP_FEATURE_FLASH_LP_CF_WRITE_SIZE - 1U)), FSP_ERR_INVALID_ADDRESS);
            FSP_ERROR_RETURN(!(num_bytes & (BSP_FEATURE_FLASH_LP_CF_WRITE_SIZE - 1U)), FSP_ERR_INVALID_SIZE);
        }
    }
    else
 #endif
    {
 #if (FLASH_LP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1)
        FSP_ERROR_RETURN((flash_address >= (FLASH_LP_DF_START_ADDRESS)) &&
                         (flash_address < (FLASH_LP_DF_START_ADDRESS + BSP_DATA_FLASH_SIZE_BYTES)),
                         FSP_ERR_INVALID_ADDRESS);
        FSP_ERROR_RETURN((flash_address + num_bytes <= (FLASH_LP_DF_START_ADDRESS + BSP_DATA_FLASH_SIZE_BYTES)),
                         FSP_ERR_INVALID_SIZE);
 #else

        return FSP_ERR_INVALID_ADDRESS;
 #endif
    }

    /* If invalid number of bytes return error. */
    FSP_ERROR_RETURN((0 != num_bytes), FSP_ERR_INVALID_SIZE);

    return FSP_SUCCESS;
}

#endif

#if (FLASH_LP_CFG_PARAM_CHECKING_ENABLE == 1)

/*******************************************************************************************************************//**
 * This function performs the parameter checking required by the R_FLASH_LP_Write() function.
 * @param      p_ctrl             Pointer to the control block
 *
 * @retval     FSP_SUCCESS        Parameter checking completed without error.
 * @retval     FSP_ERR_ASSERTION  Null pointer
 * @retval     FSP_ERR_NOT_OPEN   The flash module is not open.
 * @retval     FSP_ERR_IN_USE     The flash is currently in P/E mode.
 **********************************************************************************************************************/
static fsp_err_t r_flash_lp_common_parameter_checking (flash_lp_instance_ctrl_t * const p_ctrl)
{
    /* If null control block return error. */
    FSP_ASSERT(NULL != p_ctrl);

    /* If control block is not open return error. */
    FSP_ERROR_RETURN((FLASH_HP_OPEN == p_ctrl->opened), FSP_ERR_NOT_OPEN);

    /* If the API is not ready return error. */
    FSP_ERROR_RETURN((FLASH_LP_PRV_FENTRYR & FLASH_LP_FENTRYR_PE_MODE_BITS) == 0x0000U, FSP_ERR_IN_USE);

    return FSP_SUCCESS;
}

#endif

/*******************************************************************************************************************//**
 * This function will calculate the timeout values for various operations.
 * @param[in]  p_ctrl          Pointer to the Flash control block
 **********************************************************************************************************************/
void r_flash_lp_init (flash_lp_instance_ctrl_t * p_ctrl)
{
    /* Round up the frequency to a whole number. */
    p_ctrl->flash_clock_frequency = (p_ctrl->flash_clock_frequency + (FLASH_LP_HZ_IN_MHZ - 1)) /
                                    FLASH_LP_HZ_IN_MHZ;

    /* If the frequency is over 32MHz round up to an even number. */
#if BSP_FEATURE_FLASH_LP_VERSION == 4
    if ((p_ctrl->flash_clock_frequency > FLASH_LP_FISR_INCREASE_PCKA_EVERY_2MHZ) &&
        (1 == p_ctrl->flash_clock_frequency % 2))
    {
        p_ctrl->flash_clock_frequency++;
    }
#endif

