RT-Thread/rt-thread/bsp/renesas/ra4m1-ek/ra/fsp/src/r_flash_lp/r_flash_lp.c
    p_ctrl->system_clock_frequency = (p_ctrl->system_clock_frequency + (FLASH_LP_HZ_IN_MHZ - 1)) /
                                     FLASH_LP_HZ_IN_MHZ;

    /*  According to HW Manual the Max Programming Time for 4 bytes(RA2L1) or 8 bytes(RA2A1/RA4M1)(ROM)
     *  is 1411us.  This is with a FCLK of 1MHz. The calculation below
     *  calculates the number of ICLK ticks needed for the timeout delay.
     */
    p_ctrl->timeout_write_cf =
        (uint32_t) (FLASH_LP_MAX_WRITE_CF_TIME_US * p_ctrl->system_clock_frequency) /
        FLASH_LP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP;

    /*  According to HW Manual the Max Programming Time for 1 byte
     *  (Data Flash) is 886us.  This is with a FCLK of 4MHz. The calculation
     *  below calculates the number of ICLK ticks needed for the timeout delay.
     */
    p_ctrl->timeout_write_df =
        (uint32_t) (FLASH_LP_MAX_WRITE_DF_TIME_US * p_ctrl->system_clock_frequency) /
        FLASH_LP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP;

    /*  According to HW Manual the Max Blank Check time for 2 bytes (S12*) or 8 bytes (RA2A1/RA4M1)
     *  (Code Flash) is 87.7 usec.  This is with a FCLK of 1MHz. The calculation
     *  below calculates the number of ICLK ticks needed for the timeout delay.
     */
    p_ctrl->timeout_blank_check =
        (uint32_t) (FLASH_LP_MAX_BLANK_CHECK_TIME_US * p_ctrl->system_clock_frequency) /
        FLASH_LP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP;

    /*  According to HW Manual the Max Erasure Time for a 1KB block (S12*) or 2KB bytes (RA2A1/RA4M1) is
     *  around 289ms.  This is with a FCLK of 1MHz. The calculation below
     *  calculates the number of ICLK ticks needed for the timeout delay.
     */
    p_ctrl->timeout_erase_cf_block =
        (uint32_t) (FLASH_LP_MAX_ERASE_CF_BLOCK_TIME_US * p_ctrl->system_clock_frequency) /
        FLASH_LP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP;

    /*  According to HW Manual the Max Erasure Time for a 1KB Data Flash block is
     *  around 299ms.  This is with a FCLK of 4MHz. The calculation below
     *  calculates the number of ICLK ticks needed for the timeout delay.
     */
    p_ctrl->timeout_erase_df_block =
        (uint32_t) (FLASH_LP_MAX_ERASE_DF_BLOCK_TIME_US * p_ctrl->system_clock_frequency) /
        FLASH_LP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP;

    /*  According to HW Manual the Max Erasure Time for writing to the extra area is
     *  around 585ms. This is with a FCLK of 1MHz. The calculation below
     *  calculates the number of ICLK ticks needed for the timeout delay.
     */
    p_ctrl->timeout_write_extra_area =
        (uint32_t) (FLASH_LP_MAX_WRITE_EXTRA_AREA_TIME_US * p_ctrl->system_clock_frequency) /
        FLASH_LP_CYCLES_MINIMUM_PER_TIMEOUT_LOOP;
}

#if (FLASH_LP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1)

/*******************************************************************************************************************//**
 * This function erases a specified number of Code or Data Flash blocks
 *
 * @param[in]  p_ctrl                Pointer to the Flash control block
 * @param[in]  block_address         The starting address of the first block to erase.
 * @param[in]  num_blocks            The number of blocks to erase.
 *
 * @retval     FSP_SUCCESS           Successfully erased (non-BGO) mode or operation successfully started (BGO).
 * @retval     FSP_ERR_ERASE_FAILED  Erase failed. Flash could be locked or address could be under access window
 *                                   control.
 * @retval     FSP_ERR_TIMEOUT       Timed out waiting for the FCU to become ready.
 **********************************************************************************************************************/
static fsp_err_t r_flash_lp_df_erase (flash_lp_instance_ctrl_t * const p_ctrl,
                                      uint32_t                         block_address,
                                      uint32_t                         num_blocks)
{
    fsp_err_t err = FSP_SUCCESS;

    /* Enter data flash P/E mode. */
    r_flash_lp_df_enter_pe_mode(p_ctrl);

    /* Save the current operation parameters. */
    p_ctrl->source_start_address = block_address + FLASH_LP_DATAFLASH_ADDR_OFFSET;
    p_ctrl->operations_remaining = num_blocks;

    /* Start the code flash erase operation. */
    r_flash_lp_process_command(p_ctrl->source_start_address,
                               num_blocks * BSP_FEATURE_FLASH_LP_DF_BLOCK_SIZE,
                               FLASH_LP_FCR_ERASE);

    /* If configured for Blocking mode then don't return until the entire operation is complete */
 #if (FLASH_LP_CFG_DATA_FLASH_BGO_SUPPORT_ENABLE == 1)
    if (!p_ctrl->p_cfg->data_flash_bgo)
 #endif
    {
        /* Waits for the erase commands to be completed and verifies the result of the command execution. */
        err = r_flash_lp_wait_for_ready(p_ctrl,
                                        p_ctrl->timeout_erase_df_block * num_blocks,
                                        FLASH_LP_FSTATR2_ERASE_ERROR_BITS,
                                        FSP_ERR_ERASE_FAILED);
        FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

        /* Disable P/E mode for data flash. */
        r_flash_lp_pe_mode_exit(p_ctrl);
    }

 #if (FLASH_LP_CFG_DATA_FLASH_BGO_SUPPORT_ENABLE == 1)
    else
    {
        p_ctrl->current_operation = FLASH_OPERATION_BGO_ERASE;
        p_ctrl->flash_status_mask = FLASH_LP_FSTATR2_ERASE_ERROR_BITS;
        p_ctrl->timeout           = p_ctrl->timeout_erase_df_block;
    }
 #endif

    return err;
}

#endif

#if (FLASH_LP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)

/*******************************************************************************************************************//**
 * This function erases a specified number of Code Flash blocks
 *
 * @param[in]  p_ctrl                Pointer to the Flash control block
 * @param[in]  block_address         The starting address of the first block to erase.
 * @param[in]  num_blocks            The number of blocks to erase.
 * @param[in]  block_size            The Flash block size.
 *
 * @retval     FSP_SUCCESS           Successfully erased (non-BGO) mode or operation successfully started (BGO).
 * @retval     FSP_ERR_ERASE_FAILED  Status is indicating a Erase error.
 * @retval     FSP_ERR_TIMEOUT       Timed out waiting for the FCU to become ready.
 **********************************************************************************************************************/
static fsp_err_t r_flash_lp_cf_erase (flash_lp_instance_ctrl_t * const p_ctrl,
                                      uint32_t                         block_address,
                                      uint32_t                         num_blocks,
                                      uint32_t                         block_size)
{
    fsp_err_t err = FSP_SUCCESS;

    r_flash_lp_cf_enter_pe_mode(p_ctrl, (bool) FLASH_LP_CFG_CODE_FLASH_BANK_PROGRAMMING_ENABLE);

