RT-Thread/rt-thread/bsp/renesas/ra4m1-ek/ra/fsp/src/r_flash_lp/r_flash_lp.c
    /* Start the code flash erase operation. */
    r_flash_lp_process_command(block_address, num_blocks * block_size, FLASH_LP_FCR_ERASE);

 #if (FLASH_LP_CFG_CODE_FLASH_BANK_PROGRAMMING_ENABLE == 1)
    p_ctrl->current_operation = FLASH_OPERATION_BGO_ERASE;
    p_ctrl->flash_status_mask = FLASH_LP_FSTATR2_ERASE_ERROR_BITS;
    p_ctrl->timeout           = p_ctrl->timeout_erase_cf_block;

    return err;
 #else

    /* Wait for the operation to complete. */
    err = r_flash_lp_wait_for_ready(p_ctrl,
                                    p_ctrl->timeout_erase_cf_block * num_blocks,
                                    FLASH_LP_FSTATR2_ERASE_ERROR_BITS,
                                    FSP_ERR_ERASE_FAILED);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

    return r_flash_lp_pe_mode_exit(p_ctrl);
 #endif
}

#endif

/*******************************************************************************************************************//**
 * This function writes a specified number of bytes to Code or Data Flash.
 *
 * @param[in]  p_ctrl                Pointer to the Flash control block
 *
 * @retval     FSP_SUCCESS           Data successfully written (non-BGO) mode or operation successfully started (BGO).
 * @retval     FSP_ERR_IN_USE        Command still executing.
 * @retval     FSP_ERR_WRITE_FAILED  Status is indicating a Programming error for the requested operation. This may be
 *                                   returned if the requested Flash area is not blank.
 * @retval     FSP_ERR_TIMEOUT       Timed out waiting for the Flash sequencer to become ready.
 **********************************************************************************************************************/
static fsp_err_t r_flash_lp_write (flash_lp_instance_ctrl_t * const p_ctrl)
{
    fsp_err_t err = FSP_SUCCESS;

#if (FLASH_LP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1) || (FLASH_LP_CFG_CODE_FLASH_BANK_PROGRAMMING_ENABLE == 1)
    bool bgo = false;
#endif

#if (FLASH_LP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)
    if (p_ctrl->dest_end_address < BSP_ROM_SIZE_BYTES)
    {
 #if (FLASH_LP_CFG_CODE_FLASH_BANK_PROGRAMMING_ENABLE == 1)
        p_ctrl->current_operation = FLASH_OPERATION_CF_BGO_WRITE;
        bgo = true;
 #endif

        p_ctrl->timeout              = p_ctrl->timeout_write_cf;
        p_ctrl->operations_remaining = p_ctrl->operations_remaining / BSP_FEATURE_FLASH_LP_CF_WRITE_SIZE;
        r_flash_lp_cf_enter_pe_mode(p_ctrl, (bool) FLASH_LP_CFG_CODE_FLASH_BANK_PROGRAMMING_ENABLE);
    }
    else
#endif
    {
#if (FLASH_LP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1)
        if (p_ctrl->p_cfg->data_flash_bgo)
        {
            p_ctrl->current_operation = FLASH_OPERATION_DF_BGO_WRITE;
            bgo = true;
        }

        p_ctrl->timeout = p_ctrl->timeout_write_df;

        /* Enter data flash P/E mode. */
        r_flash_lp_df_enter_pe_mode(p_ctrl);
#endif
    }

    /* Select user area. */
    R_FACI_LP->FASR = 0U;

    while (p_ctrl->operations_remaining && (FSP_SUCCESS == err))
    {
#if (FLASH_LP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)
        if (p_ctrl->dest_end_address < BSP_ROM_SIZE_BYTES)
        {
            /* Initiate the code flash write operation. */
            r_flash_lp_cf_write_operation(p_ctrl);
        }
        else
#endif
        {
#if (FLASH_LP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1)

            /* Initiate the data flash write operation. */
            r_flash_lp_df_write_operation(p_ctrl);
#endif
        }

#if (FLASH_LP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1) || (FLASH_LP_CFG_CODE_FLASH_BANK_PROGRAMMING_ENABLE == 1)
        if (bgo)
        {
            p_ctrl->flash_status_mask = FLASH_LP_FSTATR2_WRITE_ERROR_BITS;

            return err;
        }
#endif

        err =
            r_flash_lp_wait_for_ready(p_ctrl, p_ctrl->timeout, FLASH_LP_FSTATR2_WRITE_ERROR_BITS, FSP_ERR_WRITE_FAILED);
    }

    /* If successful exit P/E mode. */
    if (FSP_SUCCESS == err)
    {
        r_flash_lp_pe_mode_exit(p_ctrl);
    }

    return err;
}

#if (FLASH_LP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1)

/*******************************************************************************************************************//**
 * Execute a single Write operation on the Low Power Data Flash data.
 * See Figure 37.21 in Section 37.13.3 of the RA2L1 manual r01uh0853ej0100-ra2l1
 *
 * @param[in]  p_ctrl                      Pointer to the Flash control block
 **********************************************************************************************************************/
static void r_flash_lp_df_write_operation (flash_lp_instance_ctrl_t * const p_ctrl)
{
    uint32_t dest_addr_idx = p_ctrl->dest_end_address + FLASH_LP_DATAFLASH_ADDR_OFFSET;

    /* Conversion to the P/E address from the read address */
    uint8_t * data8_ptr = (uint8_t *) p_ctrl->source_start_address;

    /* Increment the start/end addresses of the next write before the current write is executed. */
    p_ctrl->source_start_address += BSP_FEATURE_FLASH_LP_DF_WRITE_SIZE;
    p_ctrl->dest_end_address     += BSP_FEATURE_FLASH_LP_DF_WRITE_SIZE;
    p_ctrl->operations_remaining--;

    /* Write flash address setting */
    R_FACI_LP->FSARH = (uint16_t) ((dest_addr_idx >> 16));
    R_FACI_LP->FSARL = (uint16_t) (dest_addr_idx);

    /* Write data address setting */
    R_FACI_LP->FWBL0 = *data8_ptr;     /* For data flash there are only 8 bits used of the 16 in the reg*/

    /* Execute Write command */
    R_FACI_LP->FCR = FLASH_LP_FCR_WRITE;
}

#endif

#if (FLASH_LP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)

/*******************************************************************************************************************//**
 * Execute a single Write operation on the Low Power Code Flash data.
 * See Figure 37.19 in Section 37.13.3 of the RA2L1 manual r01uh0853ej0100-ra2l1
 *
 * @param[in]  p_ctrl                      Pointer to the Flash control block
 **********************************************************************************************************************/
static void r_flash_lp_cf_write_operation (flash_lp_instance_ctrl_t * const p_ctrl)
{
    uint16_t data[BSP_FEATURE_FLASH_LP_CF_WRITE_SIZE / 2];

    /* Write flash address setting */
    R_FACI_LP->FSARH = (uint16_t) ((p_ctrl->dest_end_address >> 16));
    R_FACI_LP->FSARL = (uint16_t) (p_ctrl->dest_end_address);

