RT-Thread/rt-thread/bsp/renesas/ra4m1-ek/ra/fsp/src/r_flash_lp/r_flash_lp.c
    /* Copy the data and write them to the flash write buffers. CM23 parts to not support unaligned access so this
     * must be done using byte access. */
    r_flash_lp_memcpy((uint8_t *) data, (uint8_t *) p_ctrl->source_start_address, BSP_FEATURE_FLASH_LP_CF_WRITE_SIZE);

    /* If there is more data to write then write the next data. */
    p_ctrl->source_start_address += BSP_FEATURE_FLASH_LP_CF_WRITE_SIZE;
    p_ctrl->dest_end_address     += BSP_FEATURE_FLASH_LP_CF_WRITE_SIZE;
    p_ctrl->operations_remaining--;

    R_FACI_LP->FWBL0 = data[0];
    R_FACI_LP->FWBH0 = data[1];
 #if BSP_FEATURE_FLASH_LP_CF_WRITE_SIZE == 8
    R_FACI_LP->FWBL1 = data[2];
    R_FACI_LP->FWBH1 = data[3];
 #endif

    /* Execute Write command */
    R_FACI_LP->FCR = FLASH_LP_FCR_WRITE;
}

#endif

#if (FLASH_LP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1)

/*******************************************************************************************************************//**
 * This function checks if the specified Data Flash address range is blank.
 *
 * @param[in]  p_ctrl                      Pointer to the Flash control block
 * @param[in]  start_address               The starting address of the Flash area to blank check.
 * @param[in]  num_bytes                   Specifies the number of bytes that need to be checked.
 * @param[out] result                      Pointer that will be populated by the API with the results of the blank check
 *                                         operation in non-BGO (blocking) mode. In this case the blank check operation
 *                                         completes here and the result is returned. In Data Flash BGO mode the blank
 *                                         check operation is only started here and the result obtained later when the
 *                                         supplied callback routine is called.
 *
 * @retval     FSP_SUCCESS                 Blankcheck operation completed with result in result, or blankcheck started
 *                                         and in-progess (BGO mode).
 * @retval     FSP_ERR_TIMEOUT             Timed out waiting for the FCU to become ready.
 * @retval     FSP_ERR_BLANK_CHECK_FAILED  An error occurred during blank checking.
 **********************************************************************************************************************/
static fsp_err_t r_flash_lp_df_blankcheck (flash_lp_instance_ctrl_t * const p_ctrl,
                                           uint32_t                         start_address,
                                           uint32_t                         num_bytes,
                                           flash_result_t                 * result)
{
    fsp_err_t err = FSP_SUCCESS;

    /* Enter data flash P/E mode. */
    r_flash_lp_df_enter_pe_mode(p_ctrl);

    /* Execute blank check command. */
    r_flash_lp_process_command(start_address + FLASH_LP_DATAFLASH_ADDR_OFFSET, num_bytes, FLASH_LP_FCR_BLANKCHECK);

 #if (FLASH_LP_CFG_DATA_FLASH_BGO_SUPPORT_ENABLE == 1)

    /* If in DF BGO mode, exit here; remaining processing if any will be done in ISR */
    if (p_ctrl->p_cfg->data_flash_bgo)
    {
        p_ctrl->current_operation = FLASH_OPERATION_DF_BGO_BLANKCHECK;
        *result         = FLASH_RESULT_BGO_ACTIVE;
        p_ctrl->timeout = p_ctrl->timeout_blank_check;

        return err;
    }
 #endif

    /* p_ctrl->timeout_blank_check specifies the wait time for a 4 code flash byte blank check. This is the same as
     * the wait time for a 1 byte Data Flash blankcheck.*/
    err =
        r_flash_lp_wait_for_ready(p_ctrl,
                                  p_ctrl->timeout_blank_check * num_bytes,
                                  FLASH_LP_FSTATR2_ILLEGAL_ERROR_BITS,
                                  FSP_ERR_BLANK_CHECK_FAILED);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

    /* Check the result of the blank check. */
    if (0U != R_FACI_LP->FSTATR00_b.BCERR0) /* Tested Flash Area is not blank*/
    {
        *result = FLASH_RESULT_NOT_BLANK;
    }
    else
    {
        *result = FLASH_RESULT_BLANK;
    }

    /* Return the data flash to P/E mode. */
    r_flash_lp_pe_mode_exit(p_ctrl);

    /* Return status. Blank status is in result. */
    return err;
}

#endif

#if (FLASH_LP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)

/*******************************************************************************************************************//**
 * This function checks if the specified Data Flash address range is blank.
 *
 * @param[in]  p_ctrl                      Pointer to the Flash control block
 * @param[in]  start_address               The starting address of the Flash area to blank check.
 * @param[in]  num_bytes                   Specifies the number of bytes that need to be checked.
 * @param[out] result                      Pointer that will be populated by the API with the results of the blank check
 *                                         operation in non-BGO (blocking) mode. In this case the blank check operation
 *                                         completes here and the result is returned. In Data Flash BGO mode the blank
 *                                         check operation is only started here and the result obtained later when the
 *                                         supplied callback routine is called.
 *
 * @retval     FSP_SUCCESS                 Blankcheck operation completed with result in result, or blankcheck started
 *                                         and in-progess (BGO mode).
 * @retval     FSP_ERR_TIMEOUT             Timed out waiting for the FCU to become ready.
 * @retval     FSP_ERR_BLANK_CHECK_FAILED  An error occurred during blank checking.
 **********************************************************************************************************************/
static fsp_err_t r_flash_lp_cf_blankcheck (flash_lp_instance_ctrl_t * const p_ctrl,
                                           uint32_t                         start_address,
                                           uint32_t                         num_bytes,
                                           flash_result_t                 * result)
{
    fsp_err_t err = FSP_SUCCESS;

    r_flash_lp_cf_enter_pe_mode(p_ctrl, (bool) FLASH_LP_CFG_CODE_FLASH_BANK_PROGRAMMING_ENABLE);

    /* Give the blank check command to the FACI. */
    r_flash_lp_process_command(start_address, num_bytes, FLASH_LP_FCR_BLANKCHECK);

 #if (FLASH_LP_CFG_CODE_FLASH_BANK_PROGRAMMING_ENABLE == 1)
    *result = FLASH_RESULT_BGO_ACTIVE;

    p_ctrl->flash_status_mask = FLASH_LP_FSTATR2_ILLEGAL_ERROR_BITS;
    p_ctrl->timeout           = p_ctrl->timeout_blank_check;

