RT-Thread/rt-thread/bsp/renesas/ra4m1-ek/ra/fsp/src/r_flash_lp/r_flash_lp.c
    p_ctrl->current_operation = FLASH_OPERATION_DF_BGO_BLANKCHECK;

    return err;
 #else

    /* p_ctrl->timeout_blank_check specifies the wait time for a 4 code flash byte blank check.
     * num_bytes is divided by 4 and then multiplied to calculate the wait time for the entire operation */
    uint32_t wait_count = p_ctrl->timeout_blank_check * ((num_bytes + 3) / 4);

    /* Wait for the blank check to complete and return result in control block. */
    err =
        r_flash_lp_wait_for_ready(p_ctrl, wait_count, FLASH_LP_FSTATR2_ILLEGAL_ERROR_BITS, FSP_ERR_BLANK_CHECK_FAILED);
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

    if (0U != R_FACI_LP->FSTATR00_b.BCERR0) /* Tested Flash Area is not blank*/
    {
        /* If the result is already NOT Blank there is no reason to continue with any subsequent checks, simply return */
        *result = FLASH_RESULT_NOT_BLANK;
    }
    else
    {
        *result = FLASH_RESULT_BLANK;
    }

    /* Return the flash to P/E mode. */
    err = r_flash_lp_pe_mode_exit(p_ctrl);

    /* Return status. Blank status is in result. */
    return err;
 #endif
}

#endif

/*******************************************************************************************************************//**
 * Initiates a flash command.
 * See Figures 37.23, 37.24, 37.26 and 37.27 in Section 37.13.3 of the RA2L1 manual r01uh0853ej0100-ra2l1
 *
 * @param[in]  start_addr      Start address of the operation.
 * @param[in]  num_bytes       Number of bytes beginning at start_addr.
 * @param[in]  command         The flash command
 **********************************************************************************************************************/
static void r_flash_lp_process_command (const uint32_t start_addr, uint32_t num_bytes, uint32_t command)
{
    uint32_t end_addr_idx = start_addr + (num_bytes - 1U);

    /* Select User Area */
    R_FACI_LP->FASR = 0U;

    /* BlankCheck start address setting */
    R_FACI_LP->FSARH = (uint16_t) ((start_addr >> 16));
    R_FACI_LP->FSARL = (uint16_t) (start_addr);

    /* BlankCheck end address setting */
    R_FACI_LP->FEARH = (uint16_t) ((end_addr_idx >> 16));
    R_FACI_LP->FEARL = (uint16_t) (end_addr_idx);

    /* Execute BlankCheck command */
    R_FACI_LP->FCR = (uint8_t) command;
}

/*******************************************************************************************************************//**
 * This function switches the peripheral from P/E mode for Code Flash or Data Flash to Read mode.
 * See Figures 37.17 and 37.18 in Section 37.13.3 of the RA2L1 manual r01uh0853ej0100-ra2l1
 *
 * @param[in]  p_ctrl                    Pointer to the Flash control block
 * @retval     FSP_SUCCESS               Successfully entered P/E mode.
 * @retval     FSP_ERR_TIMEOUT           Timed out waiting for confirmation of transition to read mode
 **********************************************************************************************************************/
static fsp_err_t r_flash_lp_pe_mode_exit (flash_lp_instance_ctrl_t * const p_ctrl)
{
#if FLASH_LP_CFG_CODE_FLASH_PROGRAMMING_ENABLE
    uint32_t flash_pe_mode = FLASH_LP_PRV_FENTRYR;
#endif

    /* Timeout counter. */
    volatile uint32_t wait_cnt = FLASH_LP_FRDY_CMD_TIMEOUT;

#if BSP_FEATURE_FLASH_LP_VERSION == 3 && FLASH_LP_CFG_CODE_FLASH_PROGRAMMING_ENABLE
    if (flash_pe_mode == FLASH_LP_FENTRYR_CF_PE_MODE)
    {
        r_flash_lp_write_fpmcr(FLASH_LP_DISCHARGE_2);

        /* Wait for 2us over (tDIS) */
        r_flash_lp_delay_us(FLASH_LP_WAIT_TDIS, p_ctrl->system_clock_frequency);

        r_flash_lp_write_fpmcr(FLASH_LP_DISCHARGE_1);
    }
#endif

    r_flash_lp_write_fpmcr(FLASH_LP_READ_MODE);

    /* Wait for flash mode transition complete. The value of tMS will depend on flash version */
    r_flash_lp_delay_us(FLASH_LP_WAIT_TMS_HIGH, p_ctrl->system_clock_frequency);

#if FLASH_LP_CFG_CODE_FLASH_PROGRAMMING_ENABLE && (FLASH_LP_CFG_CODE_FLASH_BANK_PROGRAMMING_ENABLE == 1)
    if ((flash_pe_mode == FLASH_LP_FENTRYR_CF_PE_MODE) && (0U != R_FACI_LP->FBKPGCR))
    {
        R_FACI_LP->FBKPGCR = FLASH_LP_BANK_PROGRAMMING_EXIT;
    }
#endif

    /* Clear the P/E mode register */
    FLASH_LP_PRV_FENTRYR = FLASH_LP_FENTRYR_READ_MODE;

    /* Loop until the Flash P/E mode entry register is cleared or a timeout occurs. If timeout occurs return error. */
    FLASH_LP_REGISTER_WAIT_TIMEOUT(0, FLASH_LP_PRV_FENTRYR, wait_cnt, FSP_ERR_TIMEOUT);

#if FLASH_LP_CFG_CODE_FLASH_PROGRAMMING_ENABLE
    if (flash_pe_mode == FLASH_LP_FENTRYR_CF_PE_MODE)
    {
 #if BSP_FEATURE_BSP_FLASH_CACHE
        R_BSP_FlashCacheEnable();
 #endif
 #if BSP_FEATURE_BSP_FLASH_PREFETCH_BUFFER
        R_FACI_LP->PFBER = 1;
 #endif
    }
#endif

    return FSP_SUCCESS;
}

/*******************************************************************************************************************//**
 * This function resets the Flash sequencer.
 * See Figure 37.19 in Section 37.13.3 of the RA2L1 manual r01uh0853ej0100-ra2l1
 *
 * @param[in]  p_ctrl          Pointer to the Flash control block
 **********************************************************************************************************************/
static void r_flash_lp_reset (flash_lp_instance_ctrl_t * const p_ctrl)
{
    /* Cancel any in progress BGO operation. */
    p_ctrl->current_operation = FLASH_OPERATION_NON_BGO;

    /* If not currently in PE mode then enter P/E mode. */
    if (FLASH_LP_PRV_FENTRYR == 0x0000UL)
    {
        /* Enter P/E mode so that we can execute some FACI commands. Either Code or Data Flash P/E mode would work
         * but Code Flash P/E mode requires FLASH_LP_CFG_CODE_FLASH_PROGRAMMING_ENABLE ==1, which may not be true */
        r_flash_lp_df_enter_pe_mode(p_ctrl);
    }

    /* Reset the flash. */
    R_FACI_LP->FRESETR = 1U;
    R_FACI_LP->FRESETR = 0U;

    /* Transition to Read mode */
    r_flash_lp_pe_mode_exit(p_ctrl);
}

/*******************************************************************************************************************//**
 * FLASH ready interrupt routine.
 *
 * This function implements the FLASH ready isr. The function clears the interrupt request source on entry populates the
 * callback structure with the relevant event, and providing a callback routine has been provided, calls the callback
 * function with the event.
 **********************************************************************************************************************/
void fcu_frdyi_isr (void)
{
#if (FLASH_LP_CFG_DATA_FLASH_BGO_SUPPORT_ENABLE == 1) || (FLASH_LP_CFG_CODE_FLASH_BANK_PROGRAMMING_ENABLE == 1)
    FSP_CONTEXT_SAVE
    flash_callback_args_t cb_data;
    bool operation_completed = true;

    IRQn_Type irq = R_FSP_CurrentIrqGet();

