RT-Thread/rt-thread/bsp/renesas/ra4m1-ek/ra/fsp/src/r_flash_lp/r_flash_lp.c
 #if BSP_FEATURE_ICU_HAS_IELSR

    /* Clear pending IRQ to make sure it doesn't fire again after exiting */
    R_BSP_IrqStatusClear(irq);
 #endif

    /* Recover ISR context saved in open. */
    flash_lp_instance_ctrl_t * p_ctrl = (flash_lp_instance_ctrl_t *) R_FSP_IsrContextGet(irq);

    /* If an error occurs reset and return error. */
    if ((FSP_ERR_TIMEOUT == r_flash_lp_command_finish(p_ctrl->timeout)) ||
        (0U != (R_FACI_LP->FSTATR2 & p_ctrl->flash_status_mask)))
    {
        r_flash_lp_reset(p_ctrl);

        cb_data.event = FLASH_EVENT_ERR_FAILURE;
    }
    else
    {
        /* Continue the current operation. If unknown operation set callback event to failure. */
        if (FLASH_OPERATION_BGO_ERASE == p_ctrl->current_operation)
        {
            cb_data.event = FLASH_EVENT_ERASE_COMPLETE;
        }

 #if (FLASH_LP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1)
        else if (FLASH_OPERATION_DF_BGO_WRITE == p_ctrl->current_operation)
        {
            if (p_ctrl->operations_remaining)
            {
                operation_completed = false;
                r_flash_lp_df_write_operation(p_ctrl);
            }
            else
            {
                cb_data.event = FLASH_EVENT_WRITE_COMPLETE;
            }
        }
 #endif
 #if (FLASH_LP_CFG_CODE_FLASH_BANK_PROGRAMMING_ENABLE == 1)
        else if (FLASH_OPERATION_CF_BGO_WRITE == p_ctrl->current_operation)
        {
            if (p_ctrl->operations_remaining)
            {
                operation_completed = false;
                r_flash_lp_cf_write_operation(p_ctrl);
            }
            else
            {
                cb_data.event = FLASH_EVENT_WRITE_COMPLETE;
            }
        }
 #endif
        else
        {
            /* Check the result and return it */
            if (R_FACI_LP->FSTATR00_b.BCERR0 == 1U)
            {
                cb_data.event = FLASH_EVENT_NOT_BLANK;
            }
            else
            {
                cb_data.event = FLASH_EVENT_BLANK;
            }
        }
    }

    /* If the operation completed exit read mode, release the flash, and call the callback if available. */
    if (operation_completed == true)
    {
        /* finished current operation. Exit P/E mode*/
        r_flash_lp_pe_mode_exit(p_ctrl);

        if (NULL != p_ctrl->p_cfg->p_callback)
        {
            cb_data.p_context = p_ctrl->p_cfg->p_context;

            /* Set data to identify callback to user, then call user callback. */
            p_ctrl->p_cfg->p_callback(&cb_data);
        }
    }
    FSP_CONTEXT_RESTORE
#endif
}

/*******************************************************************************************************************//**
 * Delay for the given number of micro seconds at the given frequency
 *
 * @note This is used instead of R_BSP_SoftwareDelay because that may be linked in code flash.
 *
 * @param[in]  us              Number of microseconds to delay
 * @param[in]  mhz             The frequency of the system clock
 **********************************************************************************************************************/
static void r_flash_lp_delay_us (uint32_t us, uint32_t mhz)
{
    uint32_t loop_cnt;

    /* @12 MHz, one loop is 332 ns. A delay of 5 us would require 15 loops. 15 * 332 = 4980 ns or ~ 5us*/

    /* Calculation of a loop count */
    loop_cnt = ((us * mhz) / FLASH_LP_DELAY_LOOP_CYCLES);

    if (loop_cnt > 0U)
    {
        __asm volatile ("delay_loop:\n"
#if defined(__ICCARM__) || defined(__ARMCC_VERSION) || (defined(__llvm__) && !defined(__CLANG_TIDY__))
                        "   subs %[loops_remaining], #1         \n"                 /*/< 1 cycle*/
#elif defined(__GNUC__)
                        "   sub %[loops_remaining], %[loops_remaining], #1      \n" /*/< 1 cycle*/
#endif
                        "cmp %[loops_remaining], #0\n"                              /* 1 cycle*/

/* CM0 and CM23 have different instruction sets */
#if defined(__CORE_CM0PLUS_H_GENERIC) || defined(__CORE_CM23_H_GENERIC)
                        "   bne delay_loop   \n"                                    /*/< 2 cycles*/
#else
                        "   bne.n delay_loop \n"                                    /*/< 2 cycles*/
#endif
                        :                                                           /* No outputs*/
                        :[loops_remaining] "r" (loop_cnt)
                        :                                                           /* No clobbers*/
                        );
    }
}

/*******************************************************************************************************************//**
 * Transition to Data Flash P/E mode.
 * @param[in]  p_ctrl  Pointer to the Flash control block
 **********************************************************************************************************************/
void r_flash_lp_df_enter_pe_mode (flash_lp_instance_ctrl_t * const p_ctrl)
{
    FLASH_LP_PRV_FENTRYR = FLASH_LP_FENTRYR_DATAFLASH_PE_MODE;

    r_flash_lp_delay_us(FLASH_LP_WAIT_TDSTOP, p_ctrl->system_clock_frequency);

    /* See "Procedure for changing from the read mode to the data flash P/E mode": Figure 37.16 in Section 37.13.3
     * of the RA2L1 manual r01uh0853ej0100-ra2l1 */
#if BSP_FEATURE_FLASH_LP_VERSION == 3

    /* If the device is not in high speed mode enable LVPE mode as per the flash documentation. */
    if (R_SYSTEM->OPCCR_b.OPCM == 0U)
    {
        r_flash_lp_write_fpmcr(FLASH_LP_DATAFLASH_PE_MODE);
    }
    else
    {
        r_flash_lp_write_fpmcr((uint8_t) FLASH_LP_DATAFLASH_PE_MODE | (uint8_t) FLASH_LP_LVPE_MODE);
    }

#elif BSP_FEATURE_FLASH_LP_VERSION == 4
    r_flash_lp_write_fpmcr(FLASH_LP_DATAFLASH_PE_MODE);

    r_flash_lp_delay_us(FLASH_LP_WAIT_TDIS, p_ctrl->system_clock_frequency);
#endif

#if (FLASH_LP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1) && (FLASH_LP_CFG_DATA_FLASH_BGO_SUPPORT_ENABLE == 1)

    /* If BGO mode is enabled and interrupts are being used then enable interrupts. */
    if (p_ctrl->p_cfg->data_flash_bgo == true)
    {
        /* We are supporting Flash Rdy interrupts for Data Flash operations. */
        R_BSP_IrqEnable(p_ctrl->p_cfg->irq);
    }
#endif
}

/*******************************************************************************************************************//**
 * Sets the FPMCR register, used to place the Flash sequencer in Code Flash P/E mode.
 * @param[in]  value   - 8 bit value to be written to the FPMCR register.
 **********************************************************************************************************************/
static void r_flash_lp_write_fpmcr (uint8_t value)
{
    /* The procedure for writing to FPMCR is documented in Section 37.3.4 of the RA2L1 manual r01uh0853ej0100-ra2l1 */
    R_FACI_LP->FPR = FLASH_LP_FPR_UNLOCK;

    R_FACI_LP->FPMCR = value;
    R_FACI_LP->FPMCR = (uint8_t) ~value;
    R_FACI_LP->FPMCR = value;

