RT-Thread/rt-thread/bsp/renesas/ra4m1-ek/ra/fsp/src/r_flash_lp/r_flash_lp.c
    if (value == R_FACI_LP->FPMCR)
    {
        __NOP();
    }
}

#if (FLASH_LP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)

/*******************************************************************************************************************//**
 * Configure an access window for the Code Flash memory using the provided start and end address. An access window
 * defines a contiguous area in Code Flash for which programming/erase is enabled. This area is on block boundaries. The
 * block containing start_addr is the first block. The block containing end_addr is the last block. The access window
 * then becomes first block - last block inclusive. Anything outside this range of Code Flash is then write protected.
 * This command DOES modify the configuration via The Configuration Set command to update the FAWS and FAWE.
 *
 * @param[in]  p_ctrl                Pointer to the Flash control block
 * @param[in]  start_addr            Determines the Starting block for the Code Flash access window.
 * @param[in]  end_addr              Determines the Ending block for the Code Flash access window.
 *
 * @retval     FSP_SUCCESS           Access window successfully configured.
 * @retval     FSP_ERR_WRITE_FAILED  Status is indicating a Programming error for the requested operation.
 * @retval     FSP_ERR_TIMEOUT       Timed out waiting for the FCU to become ready.
 **********************************************************************************************************************/
static fsp_err_t r_flash_lp_access_window_set (flash_lp_instance_ctrl_t * const p_ctrl,
                                               uint32_t const                   start_addr,
                                               uint32_t const                   end_addr)
{
    fsp_err_t err = FSP_SUCCESS;

    /* Enter Code Flash P/E mode */
    r_flash_lp_cf_enter_pe_mode(p_ctrl, false);

    /* Select The Extra Area */
    R_FACI_LP->FASR = 1U;

    /* Set the access window. */
    r_flash_lp_extra_operation(start_addr, end_addr, FLASH_COMMAND_ACCESSWINDOW);

    /* Wait for the operation to complete or error. */
    err = r_flash_lp_extra_check(p_ctrl);

    /* Select User Area */
    R_FACI_LP->FASR = 0U;

    /* Return to read mode. */
    fsp_err_t temp_err = r_flash_lp_pe_mode_exit(p_ctrl);

    /* If the previous commands were successful return the result of P/E exit. */
    if (FSP_SUCCESS == err)
    {
        err = temp_err;
    }

    /* Return status. */
    return err;
}

#endif

#if (FLASH_LP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)

/*******************************************************************************************************************//**
 * Set the id code
 * See Figure 37.28 in Section 37.13.3 of the RA2L1 manual r01uh0853ej0100-ra2l1
 *
 * @param      p_ctrl                Pointer to the instance control block
 * @param      p_id_code             Pointer to the code to be written
 * @param[in]  mode                  The id code mode
 *
 * @retval     FSP_SUCCESS           The id code have been written.
 * @retval     FSP_ERR_WRITE_FAILED  Status is indicating a Programming error for the requested operation.
 * @retval     FSP_ERR_TIMEOUT       Timed out waiting for completion of extra command.
 **********************************************************************************************************************/
static fsp_err_t r_flash_lp_set_id_code (flash_lp_instance_ctrl_t * const p_ctrl,
                                         uint8_t const * const            p_id_code,
                                         flash_id_code_mode_t             mode)
{
    fsp_err_t err           = FSP_SUCCESS;
    uint32_t  fexcr_command = FLASH_LP_FEXCR_OCDID1;

    uint16_t mode_mask = (uint16_t) mode;

    /* Update Flash state and enter Code Flash P/E mode */
    r_flash_lp_cf_enter_pe_mode(p_ctrl, false);

    /* For each ID byte register */
    for (uint32_t i = 0U; i < 16U; i += 4U)
    {
        /* Select Extra Area */
        R_FACI_LP->FASR = 1U;

        /* Write the ID Bytes. If mode is unlocked write all 0xFF. Write the mode mask to the MSB. */
        if (FLASH_ID_CODE_MODE_UNLOCKED == mode)
        {
            R_FACI_LP->FWBL0 = UINT16_MAX;
            R_FACI_LP->FWBH0 = UINT16_MAX;
        }
        else
        {
            /* The id code array may be unaligned. Do not attempt to optimize this code to prevent unaligned access. */
            R_FACI_LP->FWBL0 = (uint16_t) (p_id_code[i] | (p_id_code[i + 1] << 8));
            if (12U == i)
            {
                R_FACI_LP->FWBH0 = (uint16_t) (p_id_code[i + 2] | (p_id_code[i + 3] << 8)) | mode_mask;
            }
            else
            {
                R_FACI_LP->FWBH0 = (uint16_t) (p_id_code[i + 2] | (p_id_code[i + 3] << 8));
            }
        }

        /* Execute OCDID command */
        R_FACI_LP->FEXCR = fexcr_command;

        /* Increment the command to write to the next OCDID bytes */
        fexcr_command++;

        /* Wait until the operation is complete or an error. */
        err = r_flash_lp_extra_check(p_ctrl);

        /* Select User Area */
        R_FACI_LP->FASR = 0U;

        /* If failure return error */
        if (FSP_SUCCESS != err)
        {
            break;
        }
    }

    /* Return to read mode. */
    fsp_err_t temp_err = r_flash_lp_pe_mode_exit(p_ctrl);

    /* If the previous commands were successful return the result of P/E exit. */
    if (FSP_SUCCESS == err)
    {
        err = temp_err;
    }

    return err;
}

#endif

#if (FLASH_LP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)

/*******************************************************************************************************************//**
 * Modifies the start-up program swap flag (BTFLG) based on the supplied parameters. These changes will take effect on
 * the next reset. This command DOES modify the configuration via The Configuration Set command to update the BTFLG.
 *
 * @param[in]  p_ctrl                Pointer to the Flash control block
 * @param[in]  swap_type             Specifies the startup area swap being requested.
 * @param[in]  temporary             Swap blocks temporarily.
 *
 * @retval     FSP_SUCCESS           Access window successfully removed.
 * @retval     FSP_ERR_WRITE_FAILED  Status is indicating a Programming error for the requested operation.
 * @retval     FSP_ERR_TIMEOUT       Timed out waiting for the FCU to become ready.
 **********************************************************************************************************************/
static fsp_err_t r_flash_lp_set_startup_area_boot (flash_lp_instance_ctrl_t * const p_ctrl,
                                                   flash_startup_area_swap_t        swap_type,
                                                   bool                             temporary)
{
    fsp_err_t err = FSP_SUCCESS;

    /* Update Flash state and enter Code Flash P/E mode */
    r_flash_lp_cf_enter_pe_mode(p_ctrl, false);

