RT-Thread/rt-thread/bsp/renesas/ra4m1-ek/ra/fsp/src/r_flash_lp/r_flash_lp.c
    if (temporary)
    {
        /* Set the Flash initial setting startup area select bit as requested. */
        R_FACI_LP->FISR_b.SAS = swap_type;
    }
    else
    {
        /* Sets the BTFLG flag where 1 selects block 0 and 0 selects block 1. */
 #if BSP_FEATURE_FLASH_LP_VERSION == 3
        uint32_t startup_area_mask = ((uint32_t) (~swap_type & 0x1) << 8);  /* move selection to bit 8*/
 #elif BSP_FEATURE_FLASH_LP_VERSION == 4
        uint32_t startup_area_mask = ((uint32_t) (~swap_type & 0x1) << 15); /* move selection to bit 15*/
 #endif

        /* Select Extra Area */
        R_FACI_LP->FASR = 1U;

        /* Call extra operation to set the startup area. */
        r_flash_lp_extra_operation(startup_area_mask, 0, FLASH_COMMAND_STARTUPAREA);

        /* Wait until the operation is complete or an error occurs. */
        err = r_flash_lp_extra_check(p_ctrl);

        /* Select User Area */
        R_FACI_LP->FASR = 0U;
    }

    /* Return to read mode. */
    fsp_err_t temp_err = r_flash_lp_pe_mode_exit(p_ctrl);

    /* If the previous commands were successful return the result of P/E exit. */
    if (FSP_SUCCESS == err)
    {
        err = temp_err;
    }

    return err;
}

#endif

#if (FLASH_LP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)

/*******************************************************************************************************************//**
 * Command processing for the extra area.
 * See Figure 37.28 in Section 37.13.3 of the RA2L1 manual r01uh0853ej0100-ra2l1
 *
 * @param[in]  start_addr_startup_value  Determines the Starting block for the Code Flash access window.
 * @param[in]  end_addr                  Determines the Ending block for the Code Flash access window.
 * @param[in]  command                   Select from R_FLASH_ACCESSWINDOW or R_FLASH_STARTUPAREA.
 **********************************************************************************************************************/
static void r_flash_lp_extra_operation (const uint32_t    start_addr_startup_value,
                                        const uint32_t    end_addr,
                                        r_flash_command_t command)
{
    /* Per the spec: */
    /* Setting data to the FWBL0 register, this command is allowed to select the start-up area from the */
    /* default area (blocks 0-3) to the alternative area (blocks 4-7) and set the security. */
    /* Bit 8 of the FWBL0 register is 0: the alternative area (blocks 4-7) are selected as the start-up area. */
    /* Bit 8 of the FWBL0 register is 1: the default area (blocks 0-3) are selected as the start-up area. */
    /* Bit 14 of the FWBL0 register MUST be 1! Setting this bit to zero will clear the FSPR register and lock the */
    /* FLASH!!! It is not be possible to unlock it. */
 #if BSP_FEATURE_FLASH_LP_VERSION == 3
    if (FLASH_COMMAND_ACCESSWINDOW == command)
    {
        /* Set the Access Window start and end addresses. */
        /* FWBL0 reg sets the Start Block address. FWBH0 reg sets the end address. */
        /* Convert the addresses to their respective block numbers */
        R_FACI_LP->FWBL0 = (uint16_t) ((start_addr_startup_value >> BSP_FEATURE_FLASH_LP_AWS_FAW_SHIFT));
        R_FACI_LP->FWBH0 = (uint16_t) ((end_addr >> BSP_FEATURE_FLASH_LP_AWS_FAW_SHIFT));

        /* Execute Access Window command */
        R_FACI_LP->FEXCR = FLASH_LP_FEXCR_AW;
    }
    else
    {
        /* Startup Area Flag value setting */
        R_FACI_LP->FWBH0 = UINT16_MAX;

        /* FSPR must be set. Unused bits write value should be 1. */
        R_FACI_LP->FWBL0 = (start_addr_startup_value | FLASH_LP_FSCMR_FSPR_AND_UNUSED_BITS);

        /* Execute Startup Area Flag command */
        R_FACI_LP->FEXCR = FLASH_LP_FEXCR_STARTUP;
    }

 #elif BSP_FEATURE_FLASH_LP_VERSION == 4
    if (FLASH_COMMAND_ACCESSWINDOW == command)
    {
        uint32_t fawsmr = R_FACI_LP->FAWSMR & ~BSP_FEATURE_FLASH_LP_AWS_FAW_MASK;
        uint32_t fawemr = R_FACI_LP->FAWEMR & ~BSP_FEATURE_FLASH_LP_AWS_FAW_MASK;

        /* Set the Access Window start and end addresses. */
        /* FWBL0 reg sets the Start Block address. FWBH0 reg sets the end address. */
        /* Convert the addresses to their respective block numbers */
        R_FACI_LP->FWBL0 = ((start_addr_startup_value >> BSP_FEATURE_FLASH_LP_AWS_FAW_SHIFT) | fawsmr);
        R_FACI_LP->FWBH0 = ((end_addr >> BSP_FEATURE_FLASH_LP_AWS_FAW_SHIFT) | fawemr);

        /* Execute Access Window command */
        R_FACI_LP->FEXCR = FLASH_LP_FEXCR_MF4_AW_STARTUP;
    }
    else
    {
        uint32_t fawsmr = R_FACI_LP->FAWSMR;
        uint32_t fawemr = R_FACI_LP->FAWEMR & ~FLASH_LP_MF4_FAWEMR_STARTUP_AREA_MASK;

        /* Set the Access Window start and end addresses. */
        /* FWBL0 reg sets the Start Block address. FWBH0 reg sets the end address. */
        /* Convert the addresses to their respective block numbers */

        /* Set the access window start address to what was in FAWSMR. */
        R_FACI_LP->FWBL0 = fawsmr;

        /* Set the access window end address to what was in FAWEMR. Set BTFLG according to user input. */
        R_FACI_LP->FWBH0 = (start_addr_startup_value | fawemr);

        /* Execute Startup Area Flag command */
        R_FACI_LP->FEXCR = FLASH_LP_FEXCR_MF4_AW_STARTUP;
    }
 #endif
}

#endif

#if (FLASH_LP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)

/*******************************************************************************************************************//**
 * Wait for the current command to finish processing and clear the FCR register. If MF4 is used clear the processing
 * bit before clearing the rest of FCR.
 * See Figure 37.28 in Section 37.13.3 of the RA2L1 manual r01uh0853ej0100-ra2l1
 *
 * @param[in]  timeout         The timeout
 * @retval     FSP_SUCCESS     The command completed successfully.
 * @retval     FSP_ERR_TIMEOUT The command timed out.
 **********************************************************************************************************************/
static fsp_err_t r_flash_lp_extra_command_finish (uint32_t timeout)
{
    /* Timeout counter. */
    volatile uint32_t wait_cnt = timeout;

    /* If the software command of the FEXCR register is not terminated return in use. */
    FLASH_LP_REGISTER_WAIT_TIMEOUT(1, R_FACI_LP->FSTATR1_b.EXRDY, wait_cnt, FSP_ERR_TIMEOUT);

 #if BSP_FEATURE_FLASH_LP_VERSION == 4

    /* Stop Processing */
    R_FACI_LP->FEXCR = R_FACI_LP->FEXCR & ((uint8_t) ~FLASH_LP_FEXCR_PROCESSING_MASK);
 #endif

    /* Clear the Flash Extra Area Control Register. */
    R_FACI_LP->FEXCR = FLASH_LP_FEXCR_CLEAR;

    wait_cnt = timeout;

    /* Wait until the command has completed or a timeout occurs. If timeout return error. */
    FLASH_LP_REGISTER_WAIT_TIMEOUT(0, R_FACI_LP->FSTATR1_b.EXRDY, wait_cnt, FSP_ERR_TIMEOUT);

