RT-Thread/rt-thread/bsp/renesas/ra4m1-ek/ra/fsp/src/r_flash_lp/r_flash_lp.c
    return FSP_SUCCESS;
}

#endif

#if (FLASH_LP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)

/*******************************************************************************************************************//**
 * Verifying the execution result for the extra area.
 * @param[in]  p_ctrl                Pointer to the Flash control block
 * @retval     FSP_SUCCESS           Access window successfully removed.
 * @retval     FSP_ERR_WRITE_FAILED  Status is indicating a Programming error for the requested operation.
 * @retval     FSP_ERR_TIMEOUT       Timed out waiting for completion of extra command.
 **********************************************************************************************************************/
static fsp_err_t r_flash_lp_extra_check (flash_lp_instance_ctrl_t * const p_ctrl)
{
    fsp_err_t err = r_flash_lp_extra_command_finish(p_ctrl->timeout_write_extra_area);

    /* If a timeout occurs reset the flash and return error. */
    if (FSP_ERR_TIMEOUT == err)
    {
        r_flash_lp_reset(p_ctrl);

        return err;
    }

    /* If Extra Area Illegal Command Error Flag or Error during programming reset the flash and return error. */
    if (0 != (FLASH_LP_FSTATR2_WRITE_ERROR_BITS & R_FACI_LP->FSTATR2))
    {
        r_flash_lp_reset(p_ctrl);

        return FSP_ERR_WRITE_FAILED;
    }

    /* Return success. */
    return FSP_SUCCESS;
}

#endif

#if (FLASH_LP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)

/*******************************************************************************************************************//**
 * Transition to Code Flash P/E mode.
 * @param[in]  p_ctrl            Pointer to the Flash control block
 * @param[in]  bank_programming  Put the flash into bank programming mode
 **********************************************************************************************************************/
void r_flash_lp_cf_enter_pe_mode (flash_lp_instance_ctrl_t * const p_ctrl, bool bank_programming)
{
    /* While the Flash API is in use we will disable the Flash Cache. */
 #if BSP_FEATURE_BSP_FLASH_PREFETCH_BUFFER
    R_FACI_LP->PFBER = 0;
 #endif
 #if BSP_FEATURE_BSP_FLASH_CACHE
    R_BSP_FlashCacheDisable();
 #endif

 #if (FLASH_LP_CFG_CODE_FLASH_BANK_PROGRAMMING_ENABLE == 1)
    if (bank_programming)
    {
        R_BSP_IrqEnable(p_ctrl->p_cfg->irq);
    }
    else
    {
        if (FSP_INVALID_VECTOR != p_ctrl->p_cfg->irq)
        {
            R_BSP_IrqDisable(p_ctrl->p_cfg->irq); /* We are not supporting Flash Rdy interrupts for Code Flash operations*/
        }
    }

 #else
    FSP_PARAMETER_NOT_USED(bank_programming);
  #if (FLASH_LP_CFG_DATA_FLASH_PROGRAMMING_ENABLE == 1) && (FLASH_LP_CFG_DATA_FLASH_BGO_SUPPORT_ENABLE == 1)
    if (p_ctrl->p_cfg->data_flash_bgo)
    {
        R_BSP_IrqDisable(p_ctrl->p_cfg->irq);
    }
  #endif
 #endif

    FLASH_LP_PRV_FENTRYR = FLASH_LP_FENTRYR_CODEFLASH_PE_MODE;

    /* See "Procedure for changing from read mode to code flash P/E mode": See Figure 37.15 in Section 37.13.3 of the
     * RA2L1 manual r01uh0853ej0100-ra2l1 */
 #if BSP_FEATURE_FLASH_LP_VERSION == 3
    r_flash_lp_write_fpmcr(FLASH_LP_DISCHARGE_1);

    /* Wait for 2us over (tDIS) */
    r_flash_lp_delay_us(FLASH_LP_WAIT_TDIS, p_ctrl->system_clock_frequency);

    uint32_t fpmcr_command1;
    uint32_t fpmcr_command2;
    uint32_t fpmcr_mode_setup_time;

    /* If the device is not in high speed mode enable LVPE mode as per the flash documentation. */
    if (R_SYSTEM->OPCCR_b.OPCM == 0U)
    {
        fpmcr_command1        = FLASH_LP_DISCHARGE_2;
        fpmcr_command2        = FLASH_LP_CODEFLASH_PE_MODE;
        fpmcr_mode_setup_time = FLASH_LP_WAIT_TMS_HIGH;
    }
    else
    {
        fpmcr_command1        = FLASH_LP_DISCHARGE_2 | FLASH_LP_LVPE_MODE;
        fpmcr_command2        = FLASH_LP_CODEFLASH_PE_MODE | FLASH_LP_LVPE_MODE;
        fpmcr_mode_setup_time = FLASH_LP_WAIT_TMS_MID;
    }

    r_flash_lp_write_fpmcr((uint8_t) fpmcr_command1);
    r_flash_lp_write_fpmcr((uint8_t) fpmcr_command2);

    /* Wait for 5us or 3us depending on current operating mode. (tMS) */
    r_flash_lp_delay_us(fpmcr_mode_setup_time, p_ctrl->system_clock_frequency);
 #elif BSP_FEATURE_FLASH_LP_VERSION == 4
  #if (FLASH_LP_CFG_CODE_FLASH_BANK_PROGRAMMING_ENABLE == 1)
    if (bank_programming)
    {
        R_FACI_LP->FBKPGCR = FLASH_LP_BANK_PROGRAMMING_ENTER;
    }
  #endif
    r_flash_lp_write_fpmcr(0x02);

    /* Wait for 2us over (tDIS) */
    r_flash_lp_delay_us(FLASH_LP_WAIT_TDIS, p_ctrl->system_clock_frequency);
 #endif
}

#endif

/*******************************************************************************************************************//**
 * Wait for the current command to finish processing and clear the FCR register. If MF4 is used clear the processing
 * bit before clearing the rest of FCR.
 * See Figure 37.19 in Section 37.13.3 of the RA2L1 manual r01uh0853ej0100-ra2l1
 *
 * @param[in]  timeout         The timeout
 * @retval     FSP_SUCCESS     The command completed successfully.
 * @retval     FSP_ERR_TIMEOUT The command timed out.
 **********************************************************************************************************************/
static fsp_err_t r_flash_lp_command_finish (uint32_t timeout)
{
    /* Worst case timeout */
    volatile uint32_t wait = timeout;

    /* Check the Flash Ready Flag bit*/
    FLASH_LP_REGISTER_WAIT_TIMEOUT(1, R_FACI_LP->FSTATR1_b.FRDY, wait, FSP_ERR_TIMEOUT);

#if BSP_FEATURE_FLASH_LP_VERSION == 4

    /* Stop Processing */
    R_FACI_LP->FCR = R_FACI_LP->FCR & ((uint8_t) ~FLASH_LP_FCR_PROCESSING_MASK);
#endif

    /* Clear FCR register */
    R_FACI_LP->FCR = FLASH_LP_FCR_CLEAR;

    /* Worst case timeout */
    wait = timeout;

    /* Wait for the Flash Ready Flag bit to indicate ready or a timeout to occur. If timeout return error. */
    FLASH_LP_REGISTER_WAIT_TIMEOUT(0, R_FACI_LP->FSTATR1_b.FRDY, wait, FSP_ERR_TIMEOUT);

    return FSP_SUCCESS;
}

/*******************************************************************************************************************//**
 * Wait for the current command to finish processing and check for error.
 *
 * @param      p_ctrl                Pointer to the control block
 * @param[in]  timeout               The timeout
 * @param[in]  error_bits            The error bits related to the current command
 * @param[in]  return_code           The operation specific error code
 *
 * @retval     FSP_SUCCESS           Erase command successfully completed.
 * @retval     FSP_ERR_TIMEOUT       Timed out waiting for erase command completion.
 * @return     return_code           The operation specific error code.
 **********************************************************************************************************************/
static fsp_err_t r_flash_lp_wait_for_ready (flash_lp_instance_ctrl_t * const p_ctrl,
                                            uint32_t                         timeout,
                                            uint32_t                         error_bits,
                                            fsp_err_t                        return_code)
{
    fsp_err_t err = r_flash_lp_command_finish(timeout);

    /* If a timeout occurs reset the flash and return error. */
    if (FSP_ERR_TIMEOUT == err)
    {
        r_flash_lp_reset(p_ctrl);

