RT-Thread/rt-thread/bsp/renesas/ra4m1-ek/ra/fsp/src/r_flash_lp/r_flash_lp.c
        return err;
    }

    /* If an error occurs reset and return error. */
    if (0U != (R_FACI_LP->FSTATR2 & error_bits))
    {
        r_flash_lp_reset(p_ctrl);

        return return_code;
    }

    return FSP_SUCCESS;
}

/*******************************************************************************************************************//**
 * Set the flash interface peripheral clock frequency
 * @param      p_ctrl           Pointer to the interface control block
 * @retval     FSP_SUCCESS      Flash interface clock frequency successfully configured.
 * @retval     FSP_ERR_TIMEOUT  Setting the flash interface clock frequency timed out.
 **********************************************************************************************************************/
fsp_err_t r_flash_lp_set_fisr (flash_lp_instance_ctrl_t * const p_ctrl)
{
    /* Enter data flash P/E mode to enable writing to FISR. */
    r_flash_lp_df_enter_pe_mode(p_ctrl);

#if BSP_FEATURE_FLASH_LP_VERSION == 4

    /* If the flash clock is larger than 32 increment FISR_b.PCKA by 1 for every 2MHZ. (See Section 37.3.7 "Flash
     * Internal Setting Register" of the RA2L1 manual r01uh0853ej0100-ra2l1 */
    if (p_ctrl->flash_clock_frequency >= FLASH_LP_FISR_INCREASE_PCKA_EVERY_2MHZ)
    {
        R_FACI_LP->FISR_b.PCKA =
            (0x1F + ((p_ctrl->flash_clock_frequency - FLASH_LP_FISR_INCREASE_PCKA_EVERY_2MHZ) >> 1)) &
            FLASH_LP_6BIT_MASK;
    }
    else
#endif
    {
        R_FACI_LP->FISR_b.PCKA = (p_ctrl->flash_clock_frequency - 1U) & FLASH_LP_5BIT_MASK;
    }

    return r_flash_lp_pe_mode_exit(p_ctrl);
}

#if (FLASH_LP_CFG_CODE_FLASH_PROGRAMMING_ENABLE == 1)

/*******************************************************************************************************************//**
 * Local memcpy function to prevent from using memcpy linked in code flash
 *
 * @param      dest            The destination
 * @param      src             The source
 * @param[in]  len             The length
 **********************************************************************************************************************/
void r_flash_lp_memcpy (uint8_t * const dest, uint8_t * const src, uint32_t len)
{
    for (uint32_t i = 0; i < len; i++)
    {
        dest[i] = src[i];
    }
}

 #if (BSP_FEATURE_FLASH_LP_SUPPORTS_DUAL_BANK == 1)

/*******************************************************************************************************************//**
 * This function swaps which flash bank will be used to boot from after swapped and activated.
 *
 * @param[in]   p_ctrl                  Flash control block.
 *
 * @retval      FSP_SUCCESS             Banks were swapped.
 * @retval      FSP_ERR_IN_USE          Extra area is being used by other command.
 * @retval      FSP_ERR_WRITE_FAILED    Failed to write bank swap command into extra area.
 * @retval      FSP_ERR_TIMEOUT         Timed out waiting for completion of extra command or timed out waiting for
 *                                      confirmation of transition to read mode.
 **********************************************************************************************************************/
static fsp_err_t r_flash_lp_bank_swap (flash_lp_instance_ctrl_t * const p_ctrl)
{
    fsp_err_t err = FSP_SUCCESS;
    uint8_t   cur_bank;

    /* Refer to the "Example of startup bank selection flow" flowchart in the relevant hardware manual */
    cur_bank = R_FACI_LP->FCTLFR_b.BANKSWP;

    r_flash_lp_cf_enter_pe_mode(p_ctrl, false);

    /* Select The Extra Area. Needed when using FEXCR register. */
    R_FACI_LP->FASR = 1U;

    /* Change the BANKSWP[2:0] of extra area  */
    R_FACI_LP->FWBL0_b.WDATA = ~cur_bank & FLASH_LP_3BIT_MASK;
    R_FACI_LP->FWBH0_b.WDATA = 0x0000U;
    R_FACI_LP->FEXCR         = FLASH_LP_FEXCR_MF4_CONTROL;

    err = r_flash_lp_extra_check(p_ctrl);

    /* Select User Area. Need to change back to User Area before return error. */
    R_FACI_LP->FASR = 0U;

    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

    err = r_flash_lp_pe_mode_exit(p_ctrl);

  #if FLASH_LP_CFG_DUAL_BANK_INSTANT_SWAP
    FSP_ERROR_RETURN(FSP_SUCCESS == err, err);

    /* See "Example of startup bank selection flow (2/4) (change the startup bank without reset)": Figure 35.14 in
     * Section 35.6.4 of the RA2A2 manual r01uh1005ej0110-ra2a2 */

    /* Enable writing to FCTLFR. */
    R_FACI_LP->FBKSWCR = FLASH_LP_BANK_SWAP_UPDATE_ENABLE;

    /* Read BANKSWP[2:0] from the extra area */
    (void) *(uint32_t *) FLASH_LP_EXTRA_AREA_FCTLF_ADDRESS;

    /* Update FCTLFR with the new bank value. */
    R_FACI_LP->FCTLFR = ~cur_bank & FLASH_LP_3BIT_MASK;

    /* Disable writing to FCTLFR. */
    R_FACI_LP->FBKSWCR = FLASH_LP_BANK_SWAP_UPDATE_DISABLE;
  #endif

    return err;
}

 #endif
#endif
